[
     {
          "date": "2020-10-30",
          "tweet": "Joe Biden is a corrupt politician who has done nothing but betray you for 47 long years - selling out to lobbyists, China, big pharma &amp; foreign countries. He will stab you in the back. He only cares about political power &amp; he will use that power to hurt you &amp; enrich his cronies! https://t.co/8B9kZ5sdEJ",
          "retweets": 21658,
          "person": "Trump",
          "countries": [
               "China"
          ]
     },
     {
          "date": "2020-10-30",
          "tweet": "Joe Biden is a corrupt politician—the Biden family is looking more &amp; more like a crime family. They took millions of $$ from the Chinese Communists, while Vice President Biden shipped Michigan jobs to China. If Biden wins, China Wins. When we win, Michigan wins, and AMERICA wins! https://t.co/YpnjH8838X",
          "retweets": 14636,
          "person": "Trump",
          "countries": [
               "China"
          ]
     },
     {
          "date": "2020-10-30",
          "tweet": "...a cheerleader for NAFTA – sending your auto Jobs to Mexico. He voted for China’s entry into the World Trade Organization – gutting your industries to finance China’s rise. HALF of all Michigan auto manufacturing jobs were ELIMINATED after the Biden-Backed NAFTA and China...",
          "retweets": 9595,
          "person": "Trump",
          "countries": [
               "China"
          ]
     },
     {
          "date": "2020-10-30",
          "tweet": "RT @GOPChairwoman: The media’s silence and lack of reporting about Biden’s pay-for-play scheme with China is ridiculous. https://t.co/cX1ck…",
          "retweets": 9257,
          "person": "Trump",
          "countries": [
               "China"
          ]
     },
     {
          "date": "2020-10-29",
          "tweet": "For half a century, Joe Biden has been outsourcing your jobs, opening your borders, and sacrificing American blood and treasure in endless foreign wars. Joe Biden is a corrupt politician—If Biden Wins, China Wins. When We Win, Florida Wins—and America Wins! https://t.co/UdqQqmxvL7",
          "retweets": 18188,
          "person": "Trump",
          "countries": [
               "China"
          ]
     },
     {
          "date": "2020-10-27",
          "tweet": "Joe Biden is a corrupt politician. He wants to send YOUR jobs to China, while his family rakes in millions from the Chinese Communist Party. If Biden wins, China will OWN the USA. When we win, YOU win, Wisconsin wins, and AMERICA wins! #VOTE",
          "retweets": 46089,
          "person": "Trump",
          "countries": [
               "China"
          ]
     },
     {
          "date": "2020-10-27",
          "tweet": "Death rate of people going into hospitals is MUCH LOWER now than it was. @MSNBC  Wow, MSDNC has come a long way! The fact is that we have learned and done a lot about this Virus. Much different now than when it first arrived on our shores, and the World’s, from China!",
          "retweets": 13721,
          "person": "Trump",
          "countries": [
               "China"
          ]
     },
     {
          "date": "2020-10-26",
          "tweet": "RT @KimStrassel: 1) On this question of Joe Biden being somehow exonerated on the China deal, how so? WSJ news story correctly notes that h…",
          "retweets": 13293,
          "person": "Trump",
          "countries": [
               "China"
          ]
     },
     {
          "date": "2020-10-26",
          "tweet": "We have made tremendous progress with the China Virus, but the Fake News refuses to talk about it this close to the Election. COVID, COVID, COVID is being used by them, in total coordination, in order to change our great early election numbers.Should be an election law violation!",
          "retweets": 21398,
          "person": "Trump",
          "countries": [
               "China"
          ]
     },
     {
          "date": "2020-10-25",
          "tweet": "RT @TeamTrump: President @realDonaldTrump: How can Biden make a deal with China when he’s taken money from them for himself? His son walked…",
          "retweets": 6538,
          "person": "Trump",
          "countries": [
               "China"
          ]
     },
     {
          "date": "2020-10-23",
          "tweet": "Joe Biden is a corrupt politician and he’s COMPROMISED. China is desperate for Biden to win because if Biden Wins, CHINA WINS – and China will OWN AMERICA. This corruption is EXACTLY why I decided to run for President in the first place...",
          "retweets": 60551,
          "person": "Trump",
          "countries": [
               "China"
          ]
     },
     {
          "date": "2020-10-21",
          "tweet": "WSJ Editorial Board: Joe Biden Must Answer Questions About Hunter Biden and China https://t.co/pF2M9i9OSu via @BreitbartNews",
          "retweets": 19403,
          "person": "Trump",
          "countries": [
               "China"
          ]
     },
     {
          "date": "2020-10-21",
          "tweet": "....Should take care of our people. It wasn’t their fault that the Plague came in from China!",
          "retweets": 18352,
          "person": "Trump",
          "countries": [
               "China"
          ]
     },
     {
          "date": "2020-10-21",
          "tweet": "WSJ Editorial Board: Joe Biden Must Answer Questions About Hunter Biden and China https://t.co/pF2M9i9OSu via @BreitbartNews Joe Biden is a totally corrupt politician, and got caught. At least now he won’t be able to raise your Taxes - Biggest increase in U.S. history!",
          "retweets": 20823,
          "person": "Trump",
          "countries": [
               "China"
          ]
     },
     {
          "date": "2020-10-19",
          "tweet": "Dr.Tony Fauci says we don’t allow him to do television, and yet I saw him last night on @60Minutes, and he seems to get more airtime than anybody since the late, great, Bob Hope. All I ask of Tony is that he make better decisions. He said “no masks &amp; let China in”. Also, Bad arm!",
          "retweets": 32525,
          "person": "Trump",
          "countries": [
               "China"
          ]
     },
     {
          "date": "2020-10-16",
          "tweet": "RT @TheCreation: @MZHemingway @davereaboi Biden is like China stealing intellectual property. He steals every one of Trump's strong talking…",
          "retweets": 6430,
          "person": "Trump",
          "countries": [
               "China"
          ]
     },
     {
          "date": "2020-10-15",
          "tweet": "It was great to be back in North Carolina with thousands of loyal, hardworking American Patriots! This election is a simple choice: If Biden Wins, China Wins. When WE Win, YOU WIN, North Carolina WINS, and America WINS! https://t.co/jWYVYZdT3E",
          "retweets": 10961,
          "person": "Trump",
          "countries": [
               "China"
          ]
     },
     {
          "date": "2020-10-15",
          "tweet": "If Biden wins—China will OWN the United States... https://t.co/lFGOlCf82y",
          "retweets": 25892,
          "person": "Trump",
          "countries": [
               "China"
          ]
     },
     {
          "date": "2020-10-15",
          "tweet": "RT @RudyGiuliani: Biden can’t stand up to China.\n\nThey own him.\n\nHis son,brother and sister-in-law are,and have been, partners with busines…",
          "retweets": 22575,
          "person": "Trump",
          "countries": [
               "China"
          ]
     },
     {
          "date": "2020-10-13",
          "tweet": "This election is a simple choice: If Biden Wins, China Wins. When WE Win, YOU WIN, Pennsylvania WINS, and America WINS! https://t.co/dgx92ZxsBO",
          "retweets": 18123,
          "person": "Trump",
          "countries": [
               "China"
          ]
     },
     {
          "date": "2020-10-13",
          "tweet": "Totally Negative China Virus Reports. Hit it early and hard. Fake News is devastated. They are very bad (and sick!) people!",
          "retweets": 29950,
          "person": "Trump",
          "countries": [
               "China"
          ]
     },
     {
          "date": "2020-10-13",
          "tweet": "RT @thesamsorbo: Sen Ron Johnson just released his report on Biden’s corruption with China, Ukraine, and Russia. Fox doesn’t report about i…",
          "retweets": 8128,
          "person": "Trump",
          "countries": [
               "China"
          ]
     },
     {
          "date": "2020-10-12",
          "tweet": "“I’m running as a proud Democrat, for the Senate”. Sleepy Joe Biden today. It’s only going to get worse. It is not sustainable for our County - China will own us!!!!",
          "retweets": 34939,
          "person": "Trump",
          "countries": [
               "China"
          ]
     },
     {
          "date": "2020-10-12",
          "tweet": "Viewership for NBA Finals Finale Crash Nearly 70%, Beaten by Random Sunday Night Football Game https://t.co/RaDVRSE4ww via @BreitbartNews Maybe they were watching in China, but I doubt it. Zero interest!",
          "retweets": 14415,
          "person": "Trump",
          "countries": [
               "China"
          ]
     },
     {
          "date": "2020-10-12",
          "tweet": "RT @TeamTrump: Vice President @Mike_Pence: Joe Biden has been a cheerleader for China, President @realDonaldTrump put China on notice on da…",
          "retweets": 6045,
          "person": "Trump",
          "countries": [
               "China"
          ]
     },
     {
          "date": "2020-10-12",
          "tweet": "So Crazy to watch Senator Blumenthal of Connecticut lecture all on morals &amp; ethics when for 25 years he said he was a Great War Hero in Vietnam, and he was never even there. He lied &amp; cheated right up until the day he got caught. Thank you to those in military who turned him in!",
          "retweets": 35016,
          "person": "Trump",
          "countries": [
               "Vietnam"
          ]
     },
     {
          "date": "2020-10-12",
          "tweet": "Big spike in the China Plague in Europe and other places that the Fake News used to hold up as examples of places that are doing well, in order to make the U.S look bad. Be strong and vigilant, it will run its course. Vaccines and cures are coming fast!",
          "retweets": 22980,
          "person": "Trump",
          "countries": [
               "China"
          ]
     },
     {
          "date": "2020-10-11",
          "tweet": "Record 96% Approval Rating in the Republican Party. 53% Approval Rating Overall. Record 56% “Better Off Now” than 4 Years Ago (Gallup) during the Obama/Sleepy Joe Biden Administration, even as we round the turn on the China Plague. Thank you. Next year will be the BEST EVER!!!",
          "retweets": 41894,
          "person": "Trump",
          "countries": [
               "China"
          ]
     },
     {
          "date": "2020-10-7",
          "tweet": "Just spoke with Prime Minister @BorisJohnson of the United Kingdom. Very thankful for his friendship and support as I recovered from the China Virus. I am looking forward to working with him for many years to come, a great guy!",
          "retweets": 34074,
          "person": "Trump",
          "countries": [
               "China"
          ]
     },
     {
          "date": "2020-10-7",
          "tweet": "RT @stclairashley: The only thing Trump has called a lid on is China virus 🔥",
          "retweets": 6092,
          "person": "Trump",
          "countries": [
               "China"
          ]
     },
     {
          "date": "2020-10-5",
          "tweet": "....invincible hero, who not only survived every dirty trick the Democrats threw at him, but the Chinese virus as well. He will show America we no longer have to be afraid.” @MirandaDevine @NYPost  Thank you Miranda. Was over until the Plague came in from China. Will win anyway!",
          "retweets": 21849,
          "person": "Trump",
          "countries": [
               "China"
          ]
     },
     {
          "date": "2020-10-5",
          "tweet": "....invincible hero, who not only survived every dirty trick the Democrats threw at him, but the Chinese virus as well. He will show America we no longer have to be afraid.” mdevine@nypost.com  Thank you Miranda. Was over until the Plague came in from China. Will win anyway!",
          "retweets": 13570,
          "person": "Trump",
          "countries": [
               "China"
          ]
     },
     {
          "date": "2020-9-30",
          "tweet": "Many more people would have died from the China Virus if Sleepy Joe were your President. He didn’t even want me to close our Country to Infected China until TWO MONTHS  later, when he said I was right. Now he likes to say I didn’t close up “fast enough”. Just another politician!",
          "retweets": 25007,
          "person": "Trump",
          "countries": [
               "China"
          ]
     },
     {
          "date": "2020-9-27",
          "tweet": "Hanoi Dick, who lied for years by saying he was a war hero in Vietnam, and was never even there (Impeach him!), should not be entitled to a vote on anything of importance! https://t.co/QC2zv4IhYJ",
          "retweets": 17923,
          "person": "Trump",
          "countries": [
               "Vietnam"
          ]
     },
     {
          "date": "2020-9-25",
          "tweet": "RT @BBCBreaking: Kim Jong-un has apologised for killing of South Korean official, South says, in highly unusual move for North Korea\nhttps:…",
          "retweets": 6598,
          "person": "Trump",
          "countries": [
               "North Korea",
               "South Korea"
          ]
     },
     {
          "date": "2020-9-22",
          "tweet": "I was honored to be back in the Commonwealth of Pennsylvania with thousands of loyal, hardworking American Patriots. This election is a choice between Pennsylvania &amp; China. If Biden wins, China wins. When we win, Pennsylvania Wins, and AMERICA WINS! #MAGA https://t.co/GTSNoUDpHf",
          "retweets": 14596,
          "person": "Trump",
          "countries": [
               "China"
          ]
     },
     {
          "date": "2020-9-22",
          "tweet": "RT @SecPompeo: We welcome the UK, Germany, and France's rejection of China's unlawful maritime claims in the South China Sea at the United…",
          "retweets": 14363,
          "person": "Trump",
          "countries": [
               "China"
          ]
     },
     {
          "date": "2020-9-20",
          "tweet": "RT @realDonaldTrump: Joe Biden says this is a race between Scranton and Park Avenue. This is a race between Scranton and China. Joe Biden b…",
          "retweets": 39666,
          "person": "Trump",
          "countries": [
               "China"
          ]
     },
     {
          "date": "2020-9-18",
          "tweet": "...Obama killed the pharmaceutical manufacturing business in Puerto Rico. We are bringing it back from China and other faraway lands.",
          "retweets": 18240,
          "person": "Trump",
          "countries": [
               "China"
          ]
     },
     {
          "date": "2020-9-18",
          "tweet": "...Biden is a corrupt globalist sellout who never missed a chance to stab American workers in the back. If Biden wins, China wins – it’s just that simple!",
          "retweets": 20232,
          "person": "Trump",
          "countries": [
               "China"
          ]
     },
     {
          "date": "2020-9-18",
          "tweet": "Joe Biden delivered remarks to union members after spending 47 years giving their jobs to China and foreign countries in exchange for campaign cash...",
          "retweets": 26954,
          "person": "Trump",
          "countries": [
               "China"
          ]
     },
     {
          "date": "2020-9-18",
          "tweet": "Joe Biden says this is a race between Scranton and Park Avenue. This is a race between Scranton and China. Joe Biden betrayed Scranton, and America, to China and foreign countries. I will always put America First!",
          "retweets": 39259,
          "person": "Trump",
          "countries": [
               "China"
          ]
     },
     {
          "date": "2020-9-18",
          "tweet": "Sleepy Joe Biden just said that he wished I closed up one week earlier — but when I banned China from coming in, it took him TWO MONTHS to finally realize that was a good thing...",
          "retweets": 24449,
          "person": "Trump",
          "countries": [
               "China"
          ]
     },
     {
          "date": "2020-9-18",
          "tweet": "Biden FAILED BADLY with the Swine Flu. It was the Gang That Couldn’t Shoot Straight”.  He didn’t have a clue. We have done an incredible job with the much tougher China Virus!",
          "retweets": 24672,
          "person": "Trump",
          "countries": [
               "China"
          ]
     },
     {
          "date": "2020-9-17",
          "tweet": "...China as a “positive development” for America and the world. If it were up to Joe, bin Laden and Soleimani would still be alive, ISIS would be still on the rampage, and China would now be the dominant power in the world – not America.",
          "retweets": 17837,
          "person": "Trump",
          "countries": [
               "China"
          ]
     },
     {
          "date": "2020-9-17",
          "tweet": "But Chris, you don’t see any activity from China, even though it is a FAR greater threat than Russia, Russia, Russia. They will both, plus others, be able to interfere in our 2020 Election with our totally vulnerable Unsolicited (Counterfeit?) Ballot Scam. Check it out! https://t.co/mH3vrHWvS8",
          "retweets": 16796,
          "person": "Trump",
          "countries": [
               "China"
          ]
     },
     {
          "date": "2020-9-17",
          "tweet": "I would like to extend best wishes and a very happy 70th birthday to the Prime Minister of India, @narendramodi. Many happy returns to a GREAT LEADER and loyal friend! https://t.co/CWlVkHk16X",
          "retweets": 27097,
          "person": "Trump",
          "countries": [
               "India"
          ]
     },
     {
          "date": "2020-9-17",
          "tweet": "Congratulations Prime Minister Yoshihide Suga. You have a great life story! I know you will do a tremendous job for Japan and for the world. Look forward to talking soon! @kantei @sugawitter",
          "retweets": 10966,
          "person": "Trump",
          "countries": [
               "Japan"
          ]
     },
     {
          "date": "2020-9-16",
          "tweet": "Democrats are “heartless”. They don’t want to give STIMULUS PAYMENTS to people who desperately need the money, and whose fault it was NOT that the plague came in from China. Go for the much higher numbers, Republicans, it all comes back to the USA anyway (one way or another!).",
          "retweets": 31640,
          "person": "Trump",
          "countries": [
               "China"
          ]
     },
     {
          "date": "2020-9-16",
          "tweet": "China is drooling. They can’t believe this! https://t.co/AAmBGgHhyR",
          "retweets": 29510,
          "person": "Trump",
          "countries": [
               "China"
          ]
     },
     {
          "date": "2020-9-15",
          "tweet": "RT @LouDobbs: Fighting China’s Threat: @mikepillsbury touts @realDonaldTrump’s international accomplishments and his push for an arms contr…",
          "retweets": 5523,
          "person": "Trump",
          "countries": [
               "China"
          ]
     },
     {
          "date": "2020-9-13",
          "tweet": "Actually falling very steadily and fast. Deaths and hospitalizations way down, and even cases down despite far more Testing than any other country in the World, by far. India second! https://t.co/dZQEh2F7Cf",
          "retweets": 11572,
          "person": "Trump",
          "countries": [
               "India"
          ]
     },
     {
          "date": "2020-9-13",
          "tweet": "I am running for re-election to bring prosperity to Nevada, to put violent criminals behind bars, and to ensure the future belongs to AMERICA—NOT China. If we win, AMERICA WINS! If Biden wins, China wins. If Biden Wins, the rioters, anarchists, and arsonists win. VOTE! #MAGA",
          "retweets": 34475,
          "person": "Trump",
          "countries": [
               "China"
          ]
     },
     {
          "date": "2020-9-10",
          "tweet": "I have taken the toughest-ever action to stand up to China’s rampant theft of Michigan jobs. Sleepy Joe Biden has vowed to remove those Tariffs and allow China to resume its pillaging. Joe Biden’s Agenda is Made in China, my agenda is Made in the USA! https://t.co/z8EuVOUYLE",
          "retweets": 17940,
          "person": "Trump",
          "countries": [
               "China"
          ]
     },
     {
          "date": "2020-9-9",
          "tweet": "RT @TVNewsHQ: President Trump attacks Biden at tonight’s NC rally: \"If Biden wins, China wins. It's as simple as that,\" and he slams @NC_Go…",
          "retweets": 5131,
          "person": "Trump",
          "countries": [
               "China"
          ]
     },
     {
          "date": "2020-9-9",
          "tweet": "Donald Trump: If Biden Wins, China Wins. It‘s as Simple as That https://t.co/xGxy87qJma via @BreitbartNews. Would be a disaster for the USA!",
          "retweets": 17198,
          "person": "Trump",
          "countries": [
               "China"
          ]
     },
     {
          "date": "2020-9-8",
          "tweet": "Because of the China Virus, my Campaign, which has raised a lot of money, was forced to spend in order to counter the Fake News reporting about the way we handled it (China Ban, etc.). We did, and are doing, a GREAT job, and have a lot of money left over, much more than 2016....",
          "retweets": 21307,
          "person": "Trump",
          "countries": [
               "China"
          ]
     },
     {
          "date": "2020-9-8",
          "tweet": "My Campaign spent a lot of money up front in order to compensate for the false reporting and Fake News concerning our handling of the China Virus. Now they see the GREAT job we have done, and we have 3 times more than we had 4 years ago - &amp; are up in polls. Lots of $’s &amp; ENERGY!",
          "retweets": 18757,
          "person": "Trump",
          "countries": [
               "China"
          ]
     },
     {
          "date": "2020-9-7",
          "tweet": "RT @realDonaldTrump: Starting to get VERY high marks in our handling of the Coronavirus (China Virus), especially when compared to other co…",
          "retweets": 22454,
          "person": "Trump",
          "countries": [
               "China"
          ]
     },
     {
          "date": "2020-9-7",
          "tweet": "Gordon Chang: China Seems ‘to Be Favoring Joe Biden‘ in Presidential Election https://t.co/LmXVsqOJzP via @BreitbartNews. Of course they want Biden. I have taken $Billions from China and given it to our Farmers and U.S. Treasury. China would own the U.S. if Biden &amp; Hunter got in!",
          "retweets": 14598,
          "person": "Trump",
          "countries": [
               "China"
          ]
     },
     {
          "date": "2020-9-7",
          "tweet": "Starting to get VERY high marks in our handling of the Coronavirus (China Virus), especially when compared to other countries and areas of the world. Now the Vaccines (Plus) are coming, and fast!",
          "retweets": 22424,
          "person": "Trump",
          "countries": [
               "China"
          ]
     },
     {
          "date": "2020-9-5",
          "tweet": "Nancy Pelosi said she got “set up” by the owner (a very good one) of a beauty parlor. If so, how will she do in negotiations against President Xi of China, President Putin of Russia, or Kim Jong Un of North Korea. Not so well, I suspect, but far better than Joe Hiden’ would do!",
          "retweets": 40492,
          "person": "Trump",
          "countries": [
               "China",
               "North Korea"
          ]
     },
     {
          "date": "2020-9-3",
          "tweet": ".@NYGovCuomo should get his puppet New York prosecutors, who have been illegally after me and my family for years, to investigate his incompetent handling of the China Virus, and all of the deaths caused by this incompetence. It is at minimum a Nursing Home Scandal - 11,000 DEAD!",
          "retweets": 33735,
          "person": "Trump",
          "countries": [
               "China"
          ]
     },
     {
          "date": "2020-9-3",
          "tweet": "Sleepy Joe Hiden’ was acknowledged by his own people to have done a terrible job on a much easier situation, H1N1 Swine Flu. The OBiden Administration failed badly on this, &amp; now he sits back in his basement and criticizes every move we make on the China Virus. DOING GREAT JOB! https://t.co/p2H40mD7Sh",
          "retweets": 18518,
          "person": "Trump",
          "countries": [
               "China"
          ]
     },
     {
          "date": "2020-9-3",
          "tweet": "Governors Andrew Cuomo of New York has the worst record on death and China Virus. 11,000 people alone died in Nursing Homes because of his incompetence!",
          "retweets": 43532,
          "person": "Trump",
          "countries": [
               "China"
          ]
     },
     {
          "date": "2020-9-1",
          "tweet": "I was saddened to learn of the passing of India's former President, Pranab Mukherjee. I send my condolences to his family and the people of India as they grieve the loss of a great leader.",
          "retweets": 27740,
          "person": "Trump",
          "countries": [
               "India"
          ]
     },
     {
          "date": "2020-8-31",
          "tweet": "RT @DNI_Ratcliffe: China's anti-Trump election meddling raises new alarm, as DNI calls country biggest threat | Fox News https://t.co/sjTFF…",
          "retweets": 7657,
          "person": "Trump",
          "countries": [
               "China"
          ]
     },
     {
          "date": "2020-8-30",
          "tweet": "Just had a wonderful conversation with my friend, Prime Minister @AbeShinzo of Japan, who will be leaving office soon. Shinzo will soon be recognized as the greatest Prime Minister in the history of Japan, whose relationship with the USA is the best it has ever been. Special man!",
          "retweets": 49793,
          "person": "Trump",
          "countries": [
               "Japan"
          ]
     },
     {
          "date": "2020-8-29",
          "tweet": "Probably Shifty Schiff, but others also, LEAK information to the Fake News. No matter what or who it is about, including China, these deranged lowlifes like the Russia, Russia, Russia narrative. Plays better for them. @DNI_Ratcliffe doing a great job! https://t.co/44bRm8NFbB",
          "retweets": 14423,
          "person": "Trump",
          "countries": [
               "China"
          ]
     },
     {
          "date": "2020-8-26",
          "tweet": "Just In: Chinese State Media and Leaders of CHINA want Biden to win “the U.S. Election”.  If this happened (which it won’t), China would own our Country, and our Record Setting Stock Markets would literally CRASH!",
          "retweets": 53011,
          "person": "Trump",
          "countries": [
               "China"
          ]
     },
     {
          "date": "2020-8-23",
          "tweet": "Chris Wallace “forgot” to ask a very weak and pathetic Schumer puppet, Senator Chrisie Coons, why Biden fought me when I put an extremely early BAN on people coming into our Country from heavily infected China. Biden later admitted I was right! But why no question?",
          "retweets": 30216,
          "person": "Trump",
          "countries": [
               "China"
          ]
     },
     {
          "date": "2020-8-17",
          "tweet": "RT @LindseyGrahamSC: ▶️ Negotiated peace agreement between UAE and Israel.\n\n▶️ Stood up to China.\n\n▶️ Stopped caravans from Central America…",
          "retweets": 6339,
          "person": "Trump",
          "countries": [
               "China"
          ]
     },
     {
          "date": "2020-8-17",
          "tweet": "RT @LindseyGrahamSC: I remember a slow-growth economy, a weakened military, ISIS raging, Iran emboldened, China eating our lunch, businesse…",
          "retweets": 8701,
          "person": "Trump",
          "countries": [
               "China"
          ]
     },
     {
          "date": "2020-8-15",
          "tweet": "Great work by the Governors of AZ, IA, LA, and NM (@DougDucey @IAGovernor @LouisianaGov &amp; @GovMLG) who responded to my Executive Action and promptly submitted applications, that we APPROVED QUICKLY, to support Americans out of work because of the ChinaVirus. More states to come!",
          "retweets": 18749,
          "person": "Trump",
          "countries": [
               "China"
          ]
     },
     {
          "date": "2020-8-15",
          "tweet": "RT @LizRNC: Biden and Harris didn't mention China a single time in their announcement\n\nMeanwhile, President Trump is holding China accounta…",
          "retweets": 4579,
          "person": "Trump",
          "countries": [
               "China"
          ]
     },
     {
          "date": "2020-8-14",
          "tweet": "I am ready to send Rental Assistance payments to hardworking Americans that have been hurt by the ChinaVirus. DEMOCRATS ARE HOLDING THIS UP!",
          "retweets": 35408,
          "person": "Trump",
          "countries": [
               "China"
          ]
     },
     {
          "date": "2020-8-14",
          "tweet": "I am ready to have @USTreasury and @SBA send additional PPP payments to small businesses that have been hurt by the ChinaVirus. DEMOCRATS ARE HOLDING THIS UP!",
          "retweets": 18406,
          "person": "Trump",
          "countries": [
               "China"
          ]
     },
     {
          "date": "2020-8-14",
          "tweet": "RT @SaynotoT: @McKaylaRoseJ Disrespected? A billion Indians love him. So do the vast majority of Japanese, Israelis, S Koreans, Filipinos,…",
          "retweets": 4097,
          "person": "Trump",
          "countries": [
               "Japan",
               "India"
          ]
     },
     {
          "date": "2020-8-14",
          "tweet": "RT @buds1008: @KatiePavlich @LindaSuhler Let's get this straight right away Camel Laugh and China Joe will lie, lie, and lie and the media…",
          "retweets": 4332,
          "person": "Trump",
          "countries": [
               "China"
          ]
     },
     {
          "date": "2020-8-11",
          "tweet": "More Testing, which is a good thing (we have the most in the world), equals more Cases, which is Fake News Gold. They use Cases to demean the incredible job being done by the great men &amp; women of the U.S. fighting the China Plague!",
          "retweets": 25438,
          "person": "Trump",
          "countries": [
               "China"
          ]
     },
     {
          "date": "2020-8-7",
          "tweet": "I will be doing a news conference on the ChinaVirus, the just announced very good economic numbers, and the improving economy, at 7pm from Bedminster, New Jersey. Also, the subject of the Beirut, Lebanon catastrophe will be discussed.",
          "retweets": 24944,
          "person": "Trump",
          "countries": [
               "China"
          ]
     },
     {
          "date": "2020-8-7",
          "tweet": "Pelosi and Schumer only interested in Bailout Money for poorly run Democrat cities and states. Nothing to do with China Virus! Want one trillion dollars. No interest. We are going a different way!",
          "retweets": 42388,
          "person": "Trump",
          "countries": [
               "China"
          ]
     },
     {
          "date": "2020-8-7",
          "tweet": "RT @EdwardLawrence: The letter adds: “potentially allowing China to track the locations of Federal employees and contractors, build dossier…",
          "retweets": 5878,
          "person": "Trump",
          "countries": [
               "China"
          ]
     },
     {
          "date": "2020-8-7",
          "tweet": "I called the politicization of the China Virus by the Radical Left Democrats a Hoax, not the China Virus itself. Everybody knows this except for the Fake and very Corrupt Media!",
          "retweets": 37290,
          "person": "Trump",
          "countries": [
               "China"
          ]
     },
     {
          "date": "2020-8-6",
          "tweet": "RT @GOP: “Joe Biden’s polices put China first, and America last.” -@realDonaldTrump",
          "retweets": 14272,
          "person": "Trump",
          "countries": [
               "China"
          ]
     },
     {
          "date": "2020-8-5",
          "tweet": "RT @realDonaldTrump: .@BillHagertyTN, an outstanding man and one of the best Ambassadors ever (Japan), is running an excellent campaign for…",
          "retweets": 13052,
          "person": "Trump",
          "countries": [
               "Japan"
          ]
     },
     {
          "date": "2020-8-3",
          "tweet": "RECORD HIGH NASDAQ! It would all come crashing down, including your Jobs, Stocks, and 401k’s, if Sleepy Joe ever became President. China and others would own us!!!",
          "retweets": 33507,
          "person": "Trump",
          "countries": [
               "China"
          ]
     },
     {
          "date": "2020-8-3",
          "tweet": "So Crazy Nancy Pelosi said horrible things about Dr. Deborah Birx, going after her because she was too positive on the very good job we are doing on combatting the China Virus, including Vaccines &amp; Therapeutics. In order to counter Nancy, Deborah took the bait &amp; hit us. Pathetic!",
          "retweets": 25007,
          "person": "Trump",
          "countries": [
               "China"
          ]
     },
     {
          "date": "2020-8-3",
          "tweet": "With the exception of New York &amp; a few other locations, we’ve done MUCH better than most other Countries in dealing with the China Virus. Many of these countries are now having a major second wave. The Fake News is working overtime to make the USA (&amp; me) look as bad as possible!",
          "retweets": 22822,
          "person": "Trump",
          "countries": [
               "China"
          ]
     },
     {
          "date": "2020-8-3",
          "tweet": "RT @TeamTrump: President @realDonaldTrump: We achieved record-low unemployment for African Americans, Hispanic Americans, Asian Americans a…",
          "retweets": 6719,
          "person": "Trump",
          "countries": [
               "Asia"
          ]
     },
     {
          "date": "2020-8-2",
          "tweet": "Big China Virus breakouts all over the World, including nations which were thought to have done a great job. The Fake News doesn’t report this. USA will be stronger than ever before, and soon! https://t.co/pZwjvgmVTO",
          "retweets": 20159,
          "person": "Trump",
          "countries": [
               "China"
          ]
     },
     {
          "date": "2020-8-1",
          "tweet": "RT @realDonaldTrump: .@BillHagertyTN, an outstanding man and one of the best Ambassadors ever (Japan), is running an excellent campaign for…",
          "retweets": 9923,
          "person": "Trump",
          "countries": [
               "Japan"
          ]
     },
     {
          "date": "2020-7-31",
          "tweet": "Pelosi &amp; Schumer blocked desperately needed unemployment payments, which is so terrible, especially since they fully understand that it was not the workers fault that they are unemployed, it’s the fault of China!",
          "retweets": 42034,
          "person": "Trump",
          "countries": [
               "China"
          ]
     },
     {
          "date": "2020-7-31",
          "tweet": ".@BillHagertyTN, an outstanding man and one of the best Ambassadors ever (Japan), is running an excellent campaign for the Senate. He loves Tennessee and loves our Country. We need him badly in Washington. He has my Complete and Total Endorsement!\nhttps://t.co/VGeHlzYfwy",
          "retweets": 13656,
          "person": "Trump",
          "countries": [
               "Japan"
          ]
     },
     {
          "date": "2020-7-30",
          "tweet": "Major China Virus flare ups in many of the countries that the Fake News was touting as doing so well. Some of these countries are now a disaster. Lamestream Media doesn’t want to report this. Also, highly inaccurate numbers being reported by many other countries!!! @WSJ",
          "retweets": 22634,
          "person": "Trump",
          "countries": [
               "China"
          ]
     },
     {
          "date": "2020-7-29",
          "tweet": "RT @TeamTrump: White House Press Secretary @KayleighMcEnany on the @realDonaldTrump administration’s effort to develop a China Virus vaccin…",
          "retweets": 5631,
          "person": "Trump",
          "countries": [
               "China"
          ]
     },
     {
          "date": "2020-7-27",
          "tweet": "RT @SenJohnBarrasso: #NDAA funds projects at F.E. Warren Air Force Base in WY, reinforces our deterrent against China &amp; Russia, expands san…",
          "retweets": 2107,
          "person": "Trump",
          "countries": [
               "China"
          ]
     },
     {
          "date": "2020-7-26",
          "tweet": "Because of my strong focus on the China Virus, including scheduled meetings on Vaccines, our economy and much else, I won’t be able to be in New York to throw out the opening pitch for the @Yankees on August 15th. We will make it later in the season!",
          "retweets": 20714,
          "person": "Trump",
          "countries": [
               "China"
          ]
     },
     {
          "date": "2020-7-26",
          "tweet": "Crazy Nancy Pelosi said I made a mistake when I banned people from infected China from entering the U.S. in January. Tens of thousands of lives were saved, as she danced in the Streets of Chinatown (SF) in late February. Biden agreed with her, but soon admitted that I was right!",
          "retweets": 43170,
          "person": "Trump",
          "countries": [
               "China"
          ]
     },
     {
          "date": "2020-7-21",
          "tweet": "You will never hear this on the Fake News concerning the China Virus, but by comparison to most other countries, who are suffering greatly, we are doing very well - and we have done things that few other countries could have done!",
          "retweets": 23751,
          "person": "Trump",
          "countries": [
               "China"
          ]
     },
     {
          "date": "2020-7-20",
          "tweet": "We are United in our effort to defeat the Invisible China Virus, and many people say that it is Patriotic to wear a face mask when you can’t socially distance. There is nobody more Patriotic than me, your favorite President! https://t.co/iQOd1whktN",
          "retweets": 57259,
          "person": "Trump",
          "countries": [
               "China"
          ]
     },
     {
          "date": "2020-7-18",
          "tweet": "RT @ChuckRossDC: I know there's no connection between this op-ed and WaPo taking $4.6 million from Chinese foreign agent China Daily for pa…",
          "retweets": 6329,
          "person": "Trump",
          "countries": [
               "China"
          ]
     },
     {
          "date": "2020-7-14",
          "tweet": "RT @TeamTrump: President @realDonaldTrump on Joe Biden's deep love for China and Biden's many gifts to the Chinese Communist Party https://…",
          "retweets": 8734,
          "person": "Trump",
          "countries": [
               "China"
          ]
     },
     {
          "date": "2020-7-14",
          "tweet": "RT @TeamTrump: President @realDonaldTrump: “Make no mistake, we hold China fully responsible for concealing the virus and unleashing it upo…",
          "retweets": 12844,
          "person": "Trump",
          "countries": [
               "China"
          ]
     },
     {
          "date": "2020-7-10",
          "tweet": "RT @DailyCaller: ‘Offensive Nonsense’: Josh Hawley Demands Answers From NBA Over Relationship With China https://t.co/MrGC3ACwv6",
          "retweets": 5926,
          "person": "Trump",
          "countries": [
               "China"
          ]
     },
     {
          "date": "2020-7-8",
          "tweet": "RT @realDonaldTrump: Economy and Jobs are growing MUCH faster than anyone (except me!) expected. Job growth is biggest in history. China Vi…",
          "retweets": 32468,
          "person": "Trump",
          "countries": [
               "China"
          ]
     },
     {
          "date": "2020-7-8",
          "tweet": "Economy and Jobs are growing MUCH faster than anyone (except me!) expected. Job growth is biggest in history. China Virus Mortality Rate is among the LOWEST of any country. Shaping up for a good third quarter, and a great next year! NASDAQ at new record high, 401k’s way up!!!!",
          "retweets": 32468,
          "person": "Trump",
          "countries": [
               "China"
          ]
     },
     {
          "date": "2020-7-7",
          "tweet": "“COVID-19 (China Virus) Death Rate PLUNGES From Peak In U.S.” A Tenfold Decrease In Mortality. The Washington Times @WashTimes  Valerie Richardson.  We have the lowest Mortality Rate in the World. The Fake News should be reporting these most important of facts, but they don’t!",
          "retweets": 51222,
          "person": "Trump",
          "countries": [
               "China"
          ]
     },
     {
          "date": "2020-7-6",
          "tweet": "Why does the Lamestream Fake News Media REFUSE to say that China Virus deaths are down 39%, and that we now have the lowest Fatality (Mortality) Rate in the World. They just can’t stand that we are doing so well for our Country!",
          "retweets": 40339,
          "person": "Trump",
          "countries": [
               "China"
          ]
     },
     {
          "date": "2020-7-6",
          "tweet": "Why does the a Lamestream Fake News Media REFUSE to say that China Virus deaths are down 39%, and that we now have the lowest Fatality (Mortality) Rate in the World. They just can’t stand that we are doing so well for our Country!",
          "retweets": 369,
          "person": "Trump",
          "countries": [
               "China"
          ]
     },
     {
          "date": "2020-7-6",
          "tweet": "The Democrats would not have BANNED travel from heavily infected China, especially so early, therefore, far more people would have died. Corrupt Joe Biden now admits this!!!",
          "retweets": 24004,
          "person": "Trump",
          "countries": [
               "China"
          ]
     },
     {
          "date": "2020-7-6",
          "tweet": "BREAKING NEWS: The Mortality Rate for the China Virus in the U.S. is just about the LOWEST IN THE WORLD! Also, Deaths in the U.S. are way down, a tenfold decrease since the Pandemic height (and, our Economy is coming back strong!).",
          "retweets": 33456,
          "person": "Trump",
          "countries": [
               "China"
          ]
     },
     {
          "date": "2020-7-6",
          "tweet": "Deaths from the China Virus are down 39%, while our great testing program continues to lead the World, by FAR! Why isn’t the Fake News reporting that Deaths are way down? It is only because they are, indeed, FAKE NEWS!",
          "retweets": 33722,
          "person": "Trump",
          "countries": [
               "China"
          ]
     },
     {
          "date": "2020-7-6",
          "tweet": "RT @realDonaldTrump: New China Virus Cases up (because of massive testing), deaths are down, “low and steady”. The Fake News Media should r…",
          "retweets": 59601,
          "person": "Trump",
          "countries": [
               "China"
          ]
     },
     {
          "date": "2020-7-6",
          "tweet": "China has caused great damage to the United States and the rest of the World!",
          "retweets": 112656,
          "person": "Trump",
          "countries": [
               "China"
          ]
     },
     {
          "date": "2020-7-5",
          "tweet": "New China Virus Cases up (because of massive testing), deaths are down, “low and steady”. The Fake News Media should report this and also, that new job numbers are setting records!",
          "retweets": 59601,
          "person": "Trump",
          "countries": [
               "China"
          ]
     },
     {
          "date": "2020-7-4",
          "tweet": "Thank you my friend. America loves India! https://t.co/mlvJ51l8XJ",
          "retweets": 29905,
          "person": "Trump",
          "countries": [
               "India"
          ]
     },
     {
          "date": "2020-7-3",
          "tweet": "My friend, @BillHagertyTN, will be a phenomenal Senator for Tennessee! He did an incredible job for our country as Ambassador to Japan. Strong on the Economy, Trade and the Wall, Bill stands Tall for Law &amp; Order. He has my Complete and Total Endorsement! https://t.co/VGeHlAfQV8",
          "retweets": 7778,
          "person": "Trump",
          "countries": [
               "Japan"
          ]
     },
     {
          "date": "2020-6-30",
          "tweet": "As I watch the Pandemic spread its ugly face all across the world, including the tremendous damage it has done to the USA, I become more and more angry at China. People can see it, and I can feel it!",
          "retweets": 63255,
          "person": "Trump",
          "countries": [
               "China"
          ]
     },
     {
          "date": "2020-6-25",
          "tweet": "The number of ChinaVirus cases goes up, because of GREAT TESTING, while the number of deaths (mortality rate), goes way down. The Fake News doesn’t like telling you that!",
          "retweets": 56716,
          "person": "Trump",
          "countries": [
               "China"
          ]
     },
     {
          "date": "2020-6-24",
          "tweet": "Biden failed with China. They took us to the cleaners! I got $Billions out of China, and gave much of it to our targeted farmers!",
          "retweets": 34682,
          "person": "Trump",
          "countries": [
               "China"
          ]
     },
     {
          "date": "2020-6-23",
          "tweet": "We did a great job on CoronaVirus, including the very early ban on China, Ventilator production, and Testing, which is by far the most, and best, in the World. We saved millions of U.S. lives.! Yet the Fake News refuses to acknowledge this in a positive way. But they do give....",
          "retweets": 25147,
          "person": "Trump",
          "countries": [
               "China"
          ]
     },
     {
          "date": "2020-6-22",
          "tweet": "The China Trade Deal is fully intact. Hopefully they will continue to live up to the terms of the Agreement!",
          "retweets": 22652,
          "person": "Trump",
          "countries": [
               "China"
          ]
     },
     {
          "date": "2020-6-19",
          "tweet": "The Democrats are doing totally false advertising. They have done NOTHING for years, including when Sleepy Joe was V.P., and they now have a Fake ad that my China Deal is losing us jobs. Opposite, &amp; China is paying us $BILLIONS. Also, I LOVE Seniors &amp; protect Preexisting C’s.",
          "retweets": 22188,
          "person": "Trump",
          "countries": [
               "China"
          ]
     },
     {
          "date": "2020-6-18",
          "tweet": "It was not Ambassador Lighthizer’s fault (yesterday in Committee) in that perhaps I didn’t make myself clear, but the U.S. certainly does maintain a policy option, under various conditions, of a complete decoupling from China. Thank you!",
          "retweets": 21147,
          "person": "Trump",
          "countries": [
               "China"
          ]
     },
     {
          "date": "2020-6-18",
          "tweet": "....He didn’t want Bolton anywhere near him. Bolton’s dumbest of all statements set us back very badly with North Korea, even now. I asked him, “what the hell were you thinking?” He had no answer and just apologized. That was early on, I should have fired him right then &amp; there!",
          "retweets": 13849,
          "person": "Trump",
          "countries": [
               "North Korea"
          ]
     },
     {
          "date": "2020-6-18",
          "tweet": "When Wacko John Bolton went on Deface the Nation and so stupidly said that he looked at the “Libyan Model” for North Korea, all hell broke out. Kim Jong Un, who we were getting along with very well, went “ballistic”, just like his missiles - and rightfully so....",
          "retweets": 18912,
          "person": "Trump",
          "countries": [
               "North Korea"
          ]
     },
     {
          "date": "2020-6-13",
          "tweet": "We are getting the Commercial Fishing Industry in Maine back on track (will be better than ever) after suffering years of stupidity and abuse from the previous administration. Already got 5000 square miles back and available to fish. China &amp; E.U. told to drop their Tariffs now!!! https://t.co/EcRxd2qWWW",
          "retweets": 11856,
          "person": "Trump",
          "countries": [
               "China"
          ]
     },
     {
          "date": "2020-6-12",
          "tweet": "How do you think China, Russia, Japan or others would do with him in a negotiation? We would have no Country left!!! https://t.co/3YlD1ufODX",
          "retweets": 19051,
          "person": "Trump",
          "countries": [
               "China",
               "Japan"
          ]
     },
     {
          "date": "2020-6-10",
          "tweet": "RT @MarshaBlackburn: Decades of failed engagement, Western investment and unfair trade tactics built China into an industrial behemoth, giv…",
          "retweets": 11662,
          "person": "Trump",
          "countries": [
               "China"
          ]
     },
     {
          "date": "2020-6-5",
          "tweet": "RT @GreggJarrett: British Prime Minister ‘No Choice’ But to Offer Citizenship to Almost 3 Million Hong Kong Citizens https://t.co/CbPNsXxPOA",
          "retweets": 7169,
          "person": "Trump",
          "countries": [
               "Hong Kong"
          ]
     },
     {
          "date": "2020-6-5",
          "tweet": "RT @SenTomCotton: I applaud the U.K.’s decision to open its arms to Hong Kongers fleeing the tyrannical regime in Beijing. Hong Kongers sho…",
          "retweets": 4694,
          "person": "Trump",
          "countries": [
               "Hong Kong"
          ]
     },
     {
          "date": "2020-6-5",
          "tweet": "RT @SenTomCotton: I call upon the administration to prioritize the admission of persecuted Hong Kongers to the United States through the U.…",
          "retweets": 6875,
          "person": "Trump",
          "countries": [
               "Hong Kong"
          ]
     },
     {
          "date": "2020-6-4",
          "tweet": "RT @DonaldJTrumpJr: Joe China. #BeijingBiden",
          "retweets": 14591,
          "person": "Trump",
          "countries": [
               "China"
          ]
     },
     {
          "date": "2020-6-4",
          "tweet": "RT @TeamTrump: Before the plague from China, America had the BEST Black unemployment rate in American history.\n\nPresident @realDonaldTrump…",
          "retweets": 5330,
          "person": "Trump",
          "countries": [
               "China"
          ]
     },
     {
          "date": "2020-6-1",
          "tweet": "RT @FrancisBrennan: “Twitter Censors President Trump But Not Communist China? Something Doesn’t Add Up” https://t.co/PLWbEsIcHH",
          "retweets": 7175,
          "person": "Trump",
          "countries": [
               "China"
          ]
     },
     {
          "date": "2020-5-30",
          "tweet": "Here we go again. Fake News @CNN is blaming RUSSIA, RUSSIA, RUSSIA. They are sick losers with VERY bad ratings! P.S. Can’t blame China because they need the cash?",
          "retweets": 45204,
          "person": "Trump",
          "countries": [
               "China"
          ]
     },
     {
          "date": "2020-5-29",
          "tweet": "“The President has been targeted by Twitter.” @MariaBartiromo  What about all of the lies and fraudulent statements made by Adam Schiff, and so many others, on the Russian Witch Hunt Plus, Plus, Plus? What about China’s propaganda? WHO’s mistakes? No flags?  @foxandfriends",
          "retweets": 40674,
          "person": "Trump",
          "countries": [
               "China"
          ]
     },
     {
          "date": "2020-5-29",
          "tweet": "Twitter is doing nothing about all of the lies &amp; propaganda being put out by China or the Radical Left Democrat Party. They have targeted Republicans, Conservatives &amp; the President of the United States. Section 230 should be revoked by Congress. Until then, it will be regulated!",
          "retweets": 69355,
          "person": "Trump",
          "countries": [
               "China"
          ]
     },
     {
          "date": "2020-5-28",
          "tweet": "All over the World the CoronaVirus, a very bad “gift” from China, marches on. Not good!",
          "retweets": 62675,
          "person": "Trump",
          "countries": [
               "China"
          ]
     },
     {
          "date": "2020-5-27",
          "tweet": "The Radical Left Lamestream Media, together with their partner, the Do Nothing Democrats, are trying to spread a new narrative that President Trump was slow in reacting to Covid 19. Wrong, I was very fast, even doing the Ban on China long before anybody thought necessary!",
          "retweets": 29045,
          "person": "Trump",
          "countries": [
               "China"
          ]
     },
     {
          "date": "2020-5-27",
          "tweet": "We have informed both India and China that the United States is ready, willing and able to mediate or arbitrate their now raging border dispute. Thank you!",
          "retweets": 34747,
          "person": "Trump",
          "countries": [
               "China",
               "India"
          ]
     },
     {
          "date": "2020-5-26",
          "tweet": "....One person lost to this invisible virus is too much, it should have been stopped at its source, China, but I acted very quickly, and made the right decisions. Many of the current political complainers thought, at the time, that I was moving far to fast, like Crazy Nancy!",
          "retweets": 15581,
          "person": "Trump",
          "countries": [
               "China"
          ]
     },
     {
          "date": "2020-5-26",
          "tweet": "For all of the political hacks out there, if I hadn’t done my job well, &amp; early, we would have lost 1 1/2 to 2 Million People, as opposed to the 100,000 plus that looks like will be the number. That’s 15 to 20 times more than we will lose. I shut down entry from China very early!",
          "retweets": 25141,
          "person": "Trump",
          "countries": [
               "China"
          ]
     },
     {
          "date": "2020-5-25",
          "tweet": "Great reviews on our handling of Covid 19, sometimes referred to as the China Virus. Ventilators, Testing, Medical Supply Distribution, we made a lot of Governors look very good - And got no credit for so doing. Most importantly, we helped a lot of great people!",
          "retweets": 30722,
          "person": "Trump",
          "countries": [
               "China"
          ]
     },
     {
          "date": "2020-5-25",
          "tweet": "Nobody in 50 years has been WEAKER on China than Sleepy Joe Biden. He was asleep at the wheel. He gave them EVERYTHING they wanted, including rip-off Trade Deals. I am getting it all back!",
          "retweets": 36114,
          "person": "Trump",
          "countries": [
               "China"
          ]
     },
     {
          "date": "2020-5-25",
          "tweet": "Sleepy Joe Biden (mostly his reps.) went crazy when I banned, in late January, people coming in from China. He called me “xenophobic” &amp; then went equally “nuts” when we let in 44,000 people - until he was told they were American citizens coming home. He later apologized!",
          "retweets": 24932,
          "person": "Trump",
          "countries": [
               "China"
          ]
     },
     {
          "date": "2020-5-24",
          "tweet": "RT @trtworld: Japan is considering a fresh stimulus package worth over $929 billion that will consist mostly of financial aid programmes fo…",
          "retweets": 3866,
          "person": "Trump",
          "countries": [
               "Japan"
          ]
     },
     {
          "date": "2020-5-21",
          "tweet": "RT @realDonaldTrump: China is on a massive disinformation campaign because they are desperate to have Sleepy Joe Biden win the presidential…",
          "retweets": 61825,
          "person": "Trump",
          "countries": [
               "China"
          ]
     },
     {
          "date": "2020-5-20",
          "tweet": "China is on a massive disinformation campaign because they are desperate to have Sleepy Joe Biden win the presidential race so they can continue to rip-off the United States, as they have done for decades, until I came along!",
          "retweets": 61825,
          "person": "Trump",
          "countries": [
               "China"
          ]
     },
     {
          "date": "2020-5-20",
          "tweet": "Spokesman speaks stupidly on behalf of China, trying desperately to deflect the pain and carnage that their country spread throughout the world. Its disinformation and propaganda attack on the United States and Europe is a disgrace....",
          "retweets": 31495,
          "person": "Trump",
          "countries": [
               "China"
          ]
     },
     {
          "date": "2020-5-20",
          "tweet": "Some wacko in China just released a statement blaming everybody other than China for the Virus which has now killed hundreds of thousands of people. Please explain to this dope that it was the “incompetence of China”, and nothing else, that did this mass Worldwide killing!",
          "retweets": 65915,
          "person": "Trump",
          "countries": [
               "China"
          ]
     },
     {
          "date": "2020-5-16",
          "tweet": ".....are therefore given massive advantages over The United States, and everyone else? Prior to the Plague floating in from China, our Economy was blowing everybody away, the best of any country, EVER. We will be there again, and soon!",
          "retweets": 26262,
          "person": "Trump",
          "countries": [
               "China"
          ]
     },
     {
          "date": "2020-5-16",
          "tweet": "Why is it that China, for decades, and with a population much bigger than ours, is paying a tiny fraction of $’s to The World Health Organization, The United Nations and, worst of all, The World Trade Organization, where they are considered a so-called “developing country” and...",
          "retweets": 41351,
          "person": "Trump",
          "countries": [
               "China"
          ]
     },
     {
          "date": "2020-5-16",
          "tweet": "RT @realDonaldTrump: I am proud to announce that the United States will donate ventilators to our friends in India. We stand with India and…",
          "retweets": 79957,
          "person": "Trump",
          "countries": [
               "India"
          ]
     },
     {
          "date": "2020-5-16",
          "tweet": "Lou, this is just one of numerous concepts being considered under which we would pay 10% of what we have been paying over many years, matching much lower China payments. Have not made final decision. All funds are frozen. Thanks! https://t.co/xQUzHy4NDa",
          "retweets": 11183,
          "person": "Trump",
          "countries": [
               "China"
          ]
     },
     {
          "date": "2020-5-16",
          "tweet": "RT @GOPChairwoman: \"China and who can best rebuild our economy will be the dominant issues on Election Day and that’s bad news for Joe Bide…",
          "retweets": 6826,
          "person": "Trump",
          "countries": [
               "China"
          ]
     },
     {
          "date": "2020-5-16",
          "tweet": "Hello to India! https://t.co/iiR20ZLKrE",
          "retweets": 29356,
          "person": "Trump",
          "countries": [
               "India"
          ]
     },
     {
          "date": "2020-5-16",
          "tweet": "RT @DonaldJTrumpJr: Joe #BeijingBiden has spent the last half century in politics putting China first! Only @realDonaldTrump will always pu…",
          "retweets": 11290,
          "person": "Trump",
          "countries": [
               "China"
          ]
     },
     {
          "date": "2020-5-15",
          "tweet": "I am proud to announce that the United States will donate ventilators to our friends in India. We stand with India and @narendramodi during this pandemic. We’re also cooperating on vaccine development. Together we will beat the invisible enemy!",
          "retweets": 79566,
          "person": "Trump",
          "countries": [
               "India"
          ]
     },
     {
          "date": "2020-5-14",
          "tweet": "RT @WhiteHouse: President @realDonaldTrump: \"Every other President let China do whatever they wanted.\" https://t.co/jEffuEFUlv",
          "retweets": 11678,
          "person": "Trump",
          "countries": [
               "China"
          ]
     },
     {
          "date": "2020-5-13",
          "tweet": "As I have said for a long time, dealing with China is a very expensive thing to do. We just made a great Trade Deal, the ink was barely dry, and the World was hit by the Plague from China. 100 Trade Deals wouldn’t make up the difference - and all those innocent lives lost!",
          "retweets": 45539,
          "person": "Trump",
          "countries": [
               "China"
          ]
     },
     {
          "date": "2020-5-12",
          "tweet": "Asian Americans are VERY angry at what China has done to our Country, and the World. Chinese Americans are the most angry of all. I don’t blame them!",
          "retweets": 39167,
          "person": "Trump",
          "countries": [
               "Asia",
               "China"
          ]
     },
     {
          "date": "2020-5-10",
          "tweet": "RT @DailyCaller: China Asked The WHO To Help Cover Up Coronavirus, German Intelligence Concludes\nhttps://t.co/ilUVxPqklx",
          "retweets": 18347,
          "person": "Trump",
          "countries": [
               "China"
          ]
     },
     {
          "date": "2020-5-10",
          "tweet": "RT @mikandynothem: Trump; first President in history with the courage to stand up to China, especially after Obama's disastrous foreign pol…",
          "retweets": 16489,
          "person": "Trump",
          "countries": [
               "China"
          ]
     },
     {
          "date": "2020-5-10",
          "tweet": ".@CBS and their show, @60Minutes, are doing everything within their power, which is far less today than it was in the past, to defend China and the horrible Virus pandemic that was inflicted on the USA and the rest of the World. I guess they want to do business in China!",
          "retweets": 31007,
          "person": "Trump",
          "countries": [
               "China"
          ]
     },
     {
          "date": "2020-5-10",
          "tweet": "RT @GreggJarrett: Joe Biden asked about Hunter’s corruption in China — responds in garbled gibberish… https://t.co/xZLBFJTf6N",
          "retweets": 9722,
          "person": "Trump",
          "countries": [
               "China"
          ]
     },
     {
          "date": "2020-5-10",
          "tweet": "We are getting great marks for the handling of the CoronaVirus pandemic, especially the very early BAN of people from China, the infectious source, entering the USA. Compare that to the Obama/Sleepy Joe disaster known as H1N1 Swine Flu. Poor marks, bad polls - didn’t have a clue!",
          "retweets": 26839,
          "person": "Trump",
          "countries": [
               "China"
          ]
     },
     {
          "date": "2020-5-5",
          "tweet": "RT @WhiteHouse: \"China’s economy has thrived through the manufacture of American products,\" Andy Puzder and Bill Hagerty write.\n\nIt's time…",
          "retweets": 7852,
          "person": "Trump",
          "countries": [
               "China"
          ]
     },
     {
          "date": "2020-5-4",
          "tweet": "MSDNC and FAKE NEWS CNN are going wild trying to protect China!",
          "retweets": 42347,
          "person": "Trump",
          "countries": [
               "China"
          ]
     },
     {
          "date": "2020-5-3",
          "tweet": "Intelligence has just reported to me that I was correct, and that they did NOT bring up the CoronaVirus subject matter until late into January, just prior to my banning China from the U.S. Also, they only spoke of the Virus in a very non-threatening, or matter of fact, manner...",
          "retweets": 41099,
          "person": "Trump",
          "countries": [
               "China"
          ]
     },
     {
          "date": "2020-5-3",
          "tweet": "....Fake News got it wrong again, as always, and tens of thousands of lives were saved by my EARLY BAN of China into our Country. The people that we’re allowed were heavily scrutinized and tested U.S. citizens, and as such, I welcome them with open arms!",
          "retweets": 23070,
          "person": "Trump",
          "countries": [
               "China"
          ]
     },
     {
          "date": "2020-5-3",
          "tweet": "RT @realDonaldTrump: Concast (@NBCNews) and Fake News @CNN are going out of their way to say GREAT things about China. They are Chinese pup…",
          "retweets": 45641,
          "person": "Trump",
          "countries": [
               "China"
          ]
     },
     {
          "date": "2020-5-2",
          "tweet": "The Democrats are just, as always, looking for trouble. They do nothing constructive, even in times of crisis. They don’t want to blame their cash cow, China, for the plague. China is blaming Europe. Dr. Fauci will be testifying before the Senate very soon! #DONOTHINGDEMOCRATS https://t.co/fgHuYeiOQY",
          "retweets": 17087,
          "person": "Trump",
          "countries": [
               "China"
          ]
     },
     {
          "date": "2020-5-1",
          "tweet": "Concast (@NBCNews) and Fake News @CNN are going out of their way to say GREAT things about China. They are Chinese puppets who want to do business there. They use USA airwaves to help China. The Enemy of the People!",
          "retweets": 45707,
          "person": "Trump",
          "countries": [
               "China"
          ]
     },
     {
          "date": "2020-4-29",
          "tweet": "RT @TrumpWarRoom: Joe Biden spent 44 years in Washington standing up FOR China.\n\nYou can't teach an old dog new tricks. https://t.co/vTjhKP…",
          "retweets": 11293,
          "person": "Trump",
          "countries": [
               "China"
          ]
     },
     {
          "date": "2020-4-25",
          "tweet": "The Do Nothing Democrats are spending much of their money on Fake Ads. I never said that the CoronaVirus is a “Hoax”, I said that the Democrats, and the way they lied about it, are a Hoax. Also, it did start with “one person from China”, and then grew, &amp; will be a “Miracle” end!",
          "retweets": 34055,
          "person": "Trump",
          "countries": [
               "China"
          ]
     },
     {
          "date": "2020-4-24",
          "tweet": "Just spoke to my friend, President Joko Widodo of the Republic of Indonesia. Asking for Ventilators, which we will provide. Great cooperation between us!",
          "retweets": 25312,
          "person": "Trump",
          "countries": [
               "Indonesia"
          ]
     },
     {
          "date": "2020-4-19",
          "tweet": "RT @DonaldJTrumpJr: Germany’s largest newspaper comes out swinging against China. This is a must watch for US journalists who seem intent o…",
          "retweets": 24051,
          "person": "Trump",
          "countries": [
               "China"
          ]
     },
     {
          "date": "2020-4-19",
          "tweet": "RT @ArthurSchwartz: She calls it “the flu” and says that calling it the China Virus is racist towards Asian Americans. Just as Xi Jinping o…",
          "retweets": 13381,
          "person": "Trump",
          "countries": [
               "Asia",
               "China"
          ]
     },
     {
          "date": "2020-4-19",
          "tweet": "RT @realDonaldTrump: China wants Sleepy Joe sooo badly. They want all of those billions of dollars that they have been paying to the U.S. b…",
          "retweets": 34270,
          "person": "Trump",
          "countries": [
               "China"
          ]
     },
     {
          "date": "2020-4-18",
          "tweet": "China wants Sleepy Joe sooo badly. They want all of those billions of dollars that they have been paying to the U.S. back, and much more. Joe is an easy mark, their DREAM CANDIDATE! https://t.co/vmvCr4SkQq",
          "retweets": 34270,
          "person": "Trump",
          "countries": [
               "China"
          ]
     },
     {
          "date": "2020-4-18",
          "tweet": "Spending the morning speaking to @fema and Military relative to CoronaVirus. Also, spoke to leaders of various countries including Poland, South Korea and Bahrain. Last night had a very gold conversation with the President of Mexico on numerous topics. Border is very strong!",
          "retweets": 16382,
          "person": "Trump",
          "countries": [
               "South Korea"
          ]
     },
     {
          "date": "2020-4-17",
          "tweet": "RT @charliekirk11: This is your daily reminder that Joe Biden flew his son to China on Air Force 2 to help him secure a $1.5 BILLION deal w…",
          "retweets": 33067,
          "person": "Trump",
          "countries": [
               "China"
          ]
     },
     {
          "date": "2020-4-17",
          "tweet": "RT @charliekirk11: Democrats care more about appeasing China than the American people.",
          "retweets": 13206,
          "person": "Trump",
          "countries": [
               "China"
          ]
     },
     {
          "date": "2020-4-17",
          "tweet": "RT @charliekirk11: In January, The WHO tweeted that China found no evidence of human-to-human transmission of COVID-19\n\nThis was a Chinese…",
          "retweets": 13350,
          "person": "Trump",
          "countries": [
               "China"
          ]
     },
     {
          "date": "2020-4-17",
          "tweet": "China has just announced a doubling in the number of their deaths from the Invisible Enemy. It is far higher than that and far higher than the U.S., not even close!",
          "retweets": 61008,
          "person": "Trump",
          "countries": [
               "China"
          ]
     },
     {
          "date": "2020-4-17",
          "tweet": "Why did the W.H.O. Ignore an email from Taiwanese health officials in late December alerting them to the possibility that CoronaVirus could be transmitted between humans? Why did the W.H.O. make several claims about the CoronaVirus that ere either inaccurate or misleading....",
          "retweets": 87781,
          "person": "Trump",
          "countries": [
               "Taiwan"
          ]
     },
     {
          "date": "2020-4-16",
          "tweet": "Crazy Nancy Pelosi deleted this from her Twitter account. She wanted everyone to pack into Chinatown long after I closed the BORDER TO CHINA. Based on her statement, she is responsible for many deaths. She’s an incompetent, third-rate politician! https://t.co/uWNI7DCG3o",
          "retweets": 98752,
          "person": "Trump",
          "countries": [
               "China"
          ]
     },
     {
          "date": "2020-4-12",
          "tweet": "The @nytimes story is a Fake, just like the “paper” itself. I was criticized for moving too fast when I issued the China Ban, long before most others wanted to do so. @SecAzar told me nothing until later, and Peter Navarro memo was same as Ban (see his statements). Fake News!",
          "retweets": 29630,
          "person": "Trump",
          "countries": [
               "China"
          ]
     },
     {
          "date": "2020-4-12",
          "tweet": "The @nytimes story is a Fake, just like the “paper” itself. I was criticized for moving too fast when I issued the China Ban, long before most others wanted to do so. @SecAzar told me nothing until later, and @PeterNavarroUSA memo was same as Ban (see his statements). Fake News!",
          "retweets": 9083,
          "person": "Trump",
          "countries": [
               "China"
          ]
     },
     {
          "date": "2020-4-12",
          "tweet": "Sorry Fake News, it’s all on tape. I banned China long before people spoke up. Thank you @OANN https://t.co/d40JQkUZg5",
          "retweets": 37181,
          "person": "Trump",
          "countries": [
               "China"
          ]
     },
     {
          "date": "2020-4-12",
          "tweet": "RT @ChuckRossDC: Scott Gottlieb says @WHO enabled China's obfuscation on coronavirus, and that it could have been containable had Beijing n…",
          "retweets": 8239,
          "person": "Trump",
          "countries": [
               "China"
          ]
     },
     {
          "date": "2020-4-12",
          "tweet": "If the Fake News Opposition Party is pushing, with all their might, the fact that President Trump “ignored early warnings about the threat,” then why did Media &amp; Dems viciously criticize me when I instituted a Travel Ban on China? They said “early &amp; not necessary.” Corrupt Media!",
          "retweets": 50131,
          "person": "Trump",
          "countries": [
               "China"
          ]
     },
     {
          "date": "2020-4-12",
          "tweet": "Great businessman &amp; philanthropist Bernie Marcus, Co-Founder of Home Depot, said that Congress was too distracted by the (phony) Impeachment Witch Hunt when they should have been investigating  CoronaVirus when it first appeared in China. Media played a big roll also!@dcexaminer",
          "retweets": 31714,
          "person": "Trump",
          "countries": [
               "China"
          ]
     },
     {
          "date": "2020-4-12",
          "tweet": "Great businessman &amp; philanthropist Bernies Marcus, Co-Founder of Home Depot, said that Congress was too distracted by the (phony) Impeachment Witch Hunt when they should have been investigating  CoronaVirus when it first appeared in China. Media played a big roll also!@dcexaminer",
          "retweets": 1987,
          "person": "Trump",
          "countries": [
               "China"
          ]
     },
     {
          "date": "2020-4-11",
          "tweet": "So now the Fake News @nytimes is tracing the CoronaVirus origins back to Europe, NOT China. This is a first! I wonder what the Failing New York Times got for this one? Are there any NAMED sources? They were recently thrown out of China like dogs, and obviously want back in. Sad!",
          "retweets": 43212,
          "person": "Trump",
          "countries": [
               "China"
          ]
     },
     {
          "date": "2020-4-11",
          "tweet": "The Wall Street Journal Editorial Board doesn’t have a clue on how to fight and win. Their views on Tariffs &amp; Trade are losers for the U.S., but winners for other countries, including China. If we followed their standards,  we’d have no Country left. They should love Sleepy Joe!",
          "retweets": 17187,
          "person": "Trump",
          "countries": [
               "China"
          ]
     },
     {
          "date": "2020-4-11",
          "tweet": "So now the Fake News @nytimes is tracing the CoronaVirus origins back to Europe, NOT China. This is a first! I wonder where the Failing New York Times got for this one? Are there any NAMED sources? They were recently thrown out of China like dogs, and obviously want back in. Sad!",
          "retweets": 8950,
          "person": "Trump",
          "countries": [
               "China"
          ]
     },
     {
          "date": "2020-4-11",
          "tweet": "So now the Fake News @nytimes is tracing the CoronaVirus origins back to Europe, NOT China. This is a first! I wonder what the Failing New York Times got for this one? Are there any NAMED sources? They were recently thrown out of China like dogs, and obviously want back in. Sad!",
          "retweets": 953,
          "person": "Trump",
          "countries": [
               "China"
          ]
     },
     {
          "date": "2020-4-11",
          "tweet": "“Trump did a deal with Japan. A lot of our product goes to Japan, and we are booming in North Dakota.” Jim on C Span, Washington Journal. Our Trade Deals will be having a big impact on our Country as they kick in!",
          "retweets": 24160,
          "person": "Trump",
          "countries": [
               "Japan"
          ]
     },
     {
          "date": "2020-4-10",
          "tweet": "RT @SenTomCotton: .@Max_Fisher claims—without evidence—that I believe the China virus was “produced by a Chinese weapons lab.” He should ha…",
          "retweets": 7541,
          "person": "Trump",
          "countries": [
               "China"
          ]
     },
     {
          "date": "2020-4-10",
          "tweet": "RT @SenTomCotton: Very grateful for the people of Vietnam and their generosity during this time. Thank you!",
          "retweets": 7800,
          "person": "Trump",
          "countries": [
               "Vietnam"
          ]
     },
     {
          "date": "2020-4-10",
          "tweet": "RT @zeusFanHouse: #Trump #Coronavirus Campaign Ad Features Joe Biden Cheerleading for China\n\n“During America’s #crisis,Biden protected #Chi…",
          "retweets": 10422,
          "person": "Trump",
          "countries": [
               "China"
          ]
     },
     {
          "date": "2020-4-10",
          "tweet": "RT @KimStrassel: The World Health Organization’s bows to China have harmed the global response to the coronavirus.  https://t.co/uC0kgXFCK9…",
          "retweets": 10919,
          "person": "Trump",
          "countries": [
               "China"
          ]
     },
     {
          "date": "2020-4-10",
          "tweet": "RT @GaryCoby: Trump vs Establishment - Part 2!\n\n#SleepyJoe Loves...\n✅ China\n✅ Open Borders\n✅ Free Healthcare for Illegals\n✅ Big Government…",
          "retweets": 4648,
          "person": "Trump",
          "countries": [
               "China"
          ]
     },
     {
          "date": "2020-4-8",
          "tweet": "This morning, 450,000 protective suits landed in Dallas, Texas. This was made possible because of the partnership of two great American companies—DuPont and FedEx—and our friends in Vietnam. Thank you! @DuPont_News @FedEx https://t.co/8yhG6tYnQW",
          "retweets": 20791,
          "person": "Trump",
          "countries": [
               "Vietnam"
          ]
     },
     {
          "date": "2020-4-8",
          "tweet": "Extraordinary times require even closer cooperation between friends. Thank you India and the Indian people for the decision on HCQ. Will not be forgotten! Thank you Prime Minister @NarendraModi for your strong leadership in helping not just India, but humanity, in this fight!",
          "retweets": 110302,
          "person": "Trump",
          "countries": [
               "India"
          ]
     },
     {
          "date": "2020-4-7",
          "tweet": "The W.H.O. really blew it. For some reason, funded largely by the United States, yet very China centric. We will be giving that a good look. Fortunately I rejected their advice on keeping our borders open to China early on. Why did they give us such a faulty recommendation?",
          "retweets": 113609,
          "person": "Trump",
          "countries": [
               "China"
          ]
     },
     {
          "date": "2020-4-4",
          "tweet": "RT @TeamTrump: It took TWO MONTHS for Joe Biden to finally admit that President @realDonaldTrump's decision to restrict travel from China w…",
          "retweets": 8625,
          "person": "Trump",
          "countries": [
               "China"
          ]
     },
     {
          "date": "2020-3-29",
          "tweet": "Happy National Vietnam War Veterans Day to all of our Vietnam era Veterans. You have earned our gratitude and thanks by your actions years ago and what you have done since returning home. The Nation thanks you and your families for your service and sacrifice. We love you! https://t.co/MbEjEcc4pW",
          "retweets": 19645,
          "person": "Trump",
          "countries": [
               "Vietnam"
          ]
     },
     {
          "date": "2020-3-27",
          "tweet": "Just finished a very good conversation with President Xi of China. Discussed in great detail the CoronaVirus that is ravaging large parts of our Planet. China has been through much &amp; has developed a strong understanding of the Virus. We are working closely together. Much respect!",
          "retweets": 51444,
          "person": "Trump",
          "countries": [
               "China"
          ]
     },
     {
          "date": "2020-3-25",
          "tweet": "Congratulations to Prime Minister Abe of Japan, and the IOC, on their very wise decision to present the Olympics in 2021. It will be a great success, and I look forward to being there!",
          "retweets": 26609,
          "person": "Trump",
          "countries": [
               "Japan"
          ]
     },
     {
          "date": "2020-3-25",
          "tweet": "Just reported that the United States has done far more “testing” than any other nation, by far! In fact, over an eight day span, the United States now does more testing than what South Korea (which has been a very successful tester) does over an eight week span. Great job!",
          "retweets": 35386,
          "person": "Trump",
          "countries": [
               "South Korea"
          ]
     },
     {
          "date": "2020-3-25",
          "tweet": "RT @GreggJarrett: Can We Trust China to Ban Wet Markets? https://t.co/qS5eCF3d0V",
          "retweets": 6050,
          "person": "Trump",
          "countries": [
               "China"
          ]
     },
     {
          "date": "2020-3-25",
          "tweet": "“President Trump’s decision to very early on restrict travel from China saved tens of thousands of lives.”  @LouDobbs @FoxBusiness",
          "retweets": 20642,
          "person": "Trump",
          "countries": [
               "China"
          ]
     },
     {
          "date": "2020-3-23",
          "tweet": "....us since the beginning of this crisis.” They meant the opposite? Forgot to mention that I closed our Country to China (and Europe) very early, long before it was considered acceptable to do so. Sleepy Joe said I was “xenophobic”, but I saved thousands of lives! Fake News!",
          "retweets": 15286,
          "person": "Trump",
          "countries": [
               "China"
          ]
     },
     {
          "date": "2020-3-23",
          "tweet": "It is very important that we totally protect our Asian American community in the United States, and all around the world. They are amazing people, and the spreading of the Virus....",
          "retweets": 35311,
          "person": "Trump",
          "countries": [
               "Asia"
          ]
     },
     {
          "date": "2020-3-23",
          "tweet": "RT @thebradfordfile: NEVER FORGET -- \n\nWhile Joe Biden was giving Hunter a ride to China on Air Force Two to close a $1.5 billion deal with…",
          "retweets": 11327,
          "person": "Trump",
          "countries": [
               "China"
          ]
     },
     {
          "date": "2020-3-23",
          "tweet": "We will be guided by the wishes of Prime Minister Abe of Japan, a great friend of the United States and a man who has done a magnificent job on the Olympic Venue, as to attending the Olympic Games in Japan. He will make the proper decision!",
          "retweets": 14275,
          "person": "Trump",
          "countries": [
               "Japan"
          ]
     },
     {
          "date": "2020-3-18",
          "tweet": "I always treated the Chinese Virus very seriously, and have done a very good job from the beginning, including my very early decision to close the “borders” from China - against the wishes of almost all. Many lives were saved. The Fake News new narrative is disgraceful &amp; false!",
          "retweets": 61030,
          "person": "Trump",
          "countries": [
               "China"
          ]
     },
     {
          "date": "2020-3-16",
          "tweet": "RT @marklevinshow: The Atlantic spews communist China’s propaganda while trashing the Trump administration.  And it’s not alone among the A…",
          "retweets": 7611,
          "person": "Trump",
          "countries": [
               "China"
          ]
     },
     {
          "date": "2020-3-15",
          "tweet": "....The USA was never set up for this, just look at the catastrophe of the H1N1 Swine Flu (Biden in charge, 17,000 people lost, very late response time), but it soon will be. Great decision to close our China, and other, borders early. Saved many lives!",
          "retweets": 13441,
          "person": "Trump",
          "countries": [
               "China"
          ]
     },
     {
          "date": "2020-3-14",
          "tweet": "RT @RealCandaceO: Good news on the coronavirus you won’t find anywhere else:\n\n-China has closed down its last coronavirus hospital. Not eno…",
          "retweets": 25444,
          "person": "Trump",
          "countries": [
               "China"
          ]
     },
     {
          "date": "2020-3-14",
          "tweet": "RT @GOPChairwoman: POTUS was right to restrict travel from China in January, and now there is more evidence that @realDonaldTrump made the…",
          "retweets": 11077,
          "person": "Trump",
          "countries": [
               "China"
          ]
     },
     {
          "date": "2020-3-13",
          "tweet": "RT @AndrewHClark: Oh no! CNN's reporter just called it the \"Wuhan virus\" and added \"which originated, as we know, in Wuhan, China.\" \n\nSomeo…",
          "retweets": 14696,
          "person": "Trump",
          "countries": [
               "China"
          ]
     },
     {
          "date": "2020-3-12",
          "tweet": "Just had a great conversation with Prime Minister Abe of Japan. I told him that the just completed Olympic venue is magnificent. He has done an incredible job, one that will make him very proud. Good things will happen for Japan and their great Prime Minister. Lots of options!",
          "retweets": 22307,
          "person": "Trump",
          "countries": [
               "Japan"
          ]
     },
     {
          "date": "2020-3-5",
          "tweet": "RT @mattgaetz: Bloomberg spent $500m just to win American Samoa. He could have spent $700m to buy the whole place. It would have been a bet…",
          "retweets": 5121,
          "person": "Trump",
          "countries": [
               "Samoa"
          ]
     },
     {
          "date": "2020-3-5",
          "tweet": "“I want to commend the President for how he has handled the CoronaVirus situation, especially his early decision to shut down access into our Country from China, despite strong opposition to that decision.” @SenTomCotton Thank you Tom!",
          "retweets": 12281,
          "person": "Trump",
          "countries": [
               "China"
          ]
     },
     {
          "date": "2020-3-3",
          "tweet": "Australia’s Central Bank cut interest rates and stated it will most likely further ease in order to make up for China’s Coronavirus situation and slowdown. They reduced to 0.5%, a record low. Other countries are doing the same thing, if not more so. Our Federal Reserve has us....",
          "retweets": 14267,
          "person": "Trump",
          "countries": [
               "China",
               "Australia"
          ]
     },
     {
          "date": "2020-3-3",
          "tweet": "Australia’s Central Bank cut interest rates and stated it will most likely further ease in order to make up for China’s Coronavirus situation and slowdown. They reduced to 0.5%, a record low. Other countries are doing the same thing, if not more so. Our Federal Reserve has us....",
          "retweets": 643,
          "person": "Trump",
          "countries": [
               "China",
               "Australia"
          ]
     },
     {
          "date": "2020-3-2",
          "tweet": "I was criticized by the Democrats when I closed the Country down to China many weeks ahead of what almost everyone recommended. Saved many lives. Dems were working the Impeachment Hoax. They didn’t have a clue! Now they are fear mongering. Be calm &amp; vigilant!",
          "retweets": 36366,
          "person": "Trump",
          "countries": [
               "China"
          ]
     },
     {
          "date": "2020-2-28",
          "tweet": "So, the Coronavirus, which started in China and spread to various countries throughout the world, but very slowly in the U.S. because President Trump closed our border, and ended flights, VERY EARLY, is now being blamed, by the Do Nothing Democrats, to be the fault of “Trump”.",
          "retweets": 34970,
          "person": "Trump",
          "countries": [
               "China"
          ]
     },
     {
          "date": "2020-2-27",
          "tweet": "Congratulations and thank you to our great Vice President &amp; all of the many professionals doing such a fine job at CDC &amp; all other agencies on the Coronavirus situation. Only a very small number in U.S., &amp; China numbers look to be going down. All countries working well together!",
          "retweets": 21032,
          "person": "Trump",
          "countries": [
               "China"
          ]
     },
     {
          "date": "2020-2-26",
          "tweet": "Just landed. India was great, trip very successful. Heading to the White House. Meetings and calls scheduled today. @CDCgov, @SecAzar and all doing a great job with respect to Coronavirus! Briefing this afternoon.",
          "retweets": 17818,
          "person": "Trump",
          "countries": [
               "India"
          ]
     },
     {
          "date": "2020-2-26",
          "tweet": "RT @TocRadio: in case you were wondering, YES, Trump apparently was watching the #DemDebate on his flight back to Washington, DC from India…",
          "retweets": 5811,
          "person": "Trump",
          "countries": [
               "India"
          ]
     },
     {
          "date": "2020-2-26",
          "tweet": "RT @LouDobbs: Controlling the Pandemic: Dr. Anthony Fauci says travel restrictions from China puts America a step ahead of Coronavirus outb…",
          "retweets": 4629,
          "person": "Trump",
          "countries": [
               "China"
          ]
     },
     {
          "date": "2020-2-25",
          "tweet": "RT @WhiteHouse: THANK YOU, India! 🇺🇸🇮🇳 https://t.co/IkGtp0zpyj",
          "retweets": 27606,
          "person": "Trump",
          "countries": [
               "India"
          ]
     },
     {
          "date": "2020-2-25",
          "tweet": "RT @PMOIndia: यह संबंध, 21वीं सदी की सबसे महत्वपूर्ण पार्टनरशिप्स में है।  \n \nऔर इसलिए आज राष्ट्रपति Trump और मैंने हमारे सम्बन्धों को Comp…",
          "retweets": 9081,
          "person": "Trump",
          "countries": [
               "India"
          ]
     },
     {
          "date": "2020-2-25",
          "tweet": "RT @narendramodi: Yet another excellent meeting and talks with my friend @realDonaldTrump.\n\nRelations between India and USA are not merely…",
          "retweets": 18497,
          "person": "Trump",
          "countries": [
               "India"
          ]
     },
     {
          "date": "2020-2-24",
          "tweet": "RT @GOP: “America loves India, America respects India, and America will always be faithful and loyal friends to the Indian people!” -@realD…",
          "retweets": 8490,
          "person": "Trump",
          "countries": [
               "India"
          ]
     },
     {
          "date": "2020-2-24",
          "tweet": "RT @WhiteHouse: Commerce between the U.S. and India has increased by more than 40% since President @realDonaldTrump took office.\n\nIndia is…",
          "retweets": 13344,
          "person": "Trump",
          "countries": [
               "India"
          ]
     },
     {
          "date": "2020-2-24",
          "tweet": "RT @PlaysTrumpCard: @Lrihendry @realDonaldTrump President Trump &amp; Prime Minister Modi have brought the USA and India closer in friendship t…",
          "retweets": 5757,
          "person": "Trump",
          "countries": [
               "India"
          ]
     },
     {
          "date": "2020-2-24",
          "tweet": "Our two national constitutions both begin with the same three beautiful words: “We the people.” That means that in America and India alike, we honor, respect, trust, empower, and fight for the citizens we proudly serve! 🇺🇸🇮🇳 https://t.co/hfKKSqlVfe",
          "retweets": 26770,
          "person": "Trump",
          "countries": [
               "India"
          ]
     },
     {
          "date": "2020-2-23",
          "tweet": "RT @narendramodi: India looks forward to welcoming @POTUS @realDonaldTrump. \n\nIt is an honour that he will be with us tomorrow, starting wi…",
          "retweets": 23510,
          "person": "Trump",
          "countries": [
               "India"
          ]
     },
     {
          "date": "2020-2-23",
          "tweet": "Departing for India with Melania! https://t.co/sZhb3E1AoB",
          "retweets": 28841,
          "person": "Trump",
          "countries": [
               "India"
          ]
     },
     {
          "date": "2020-2-19",
          "tweet": "RT @Bhuvanbagga: The world's newest &amp; biggest #cricket stadium -- also the venue of joint Modi-Trump visit in western #India's Gujarat stat…",
          "retweets": 4611,
          "person": "Trump",
          "countries": [
               "India"
          ]
     },
     {
          "date": "2020-2-19",
          "tweet": "RT @IndiaToday: Here's all that you need to know about US President Donald Trump's visit to India.\n#ITVideo \nMore videos: https://t.co/wMGG…",
          "retweets": 4428,
          "person": "Trump",
          "countries": [
               "India"
          ]
     },
     {
          "date": "2020-2-19",
          "tweet": "RT @ANI: #WATCH US President Donald Trump in Washington on his visit to India: I happen to like PM Modi a lot. He told me we will have 7 mi…",
          "retweets": 9377,
          "person": "Trump",
          "countries": [
               "India"
          ]
     },
     {
          "date": "2020-2-18",
          "tweet": "....product and goods to China and other countries. That’s what trade is all about. We don’t want to make it impossible to do business with us. That will only mean that orders will go to someplace else. As an example, I want China to buy our jet engines, the best in the World....",
          "retweets": 3614,
          "person": "Trump",
          "countries": [
               "China"
          ]
     },
     {
          "date": "2020-2-18",
          "tweet": "....product and goods to China and other countries. That’s what trade is all about. We don’t want to make it impossible to do business with us. That will only mean that orders will go to someplace else. As an example, I want China to buy our jet engines, the best in the World....",
          "retweets": 1525,
          "person": "Trump",
          "countries": [
               "China"
          ]
     },
     {
          "date": "2020-2-14",
          "tweet": "Great honor, I think?  Mark Zuckerberg recently stated that “Donald J. Trump is Number 1 on Facebook. Number 2 is Prime Minister Modi of India.” Actually, I am going to India in two weeks. Looking forward to it!",
          "retweets": 29412,
          "person": "Trump",
          "countries": [
               "India"
          ]
     },
     {
          "date": "2020-2-14",
          "tweet": "Thank you to the beautiful country of Cambodia for accepting the @CarnivalCruise ship Westerdam into your port. The United States will remember your courtesy! @MickyArison",
          "retweets": 13877,
          "person": "Trump",
          "countries": [
               "Cambodia"
          ]
     },
     {
          "date": "2020-2-7",
          "tweet": "....he will be successful, especially as the weather starts to warm &amp; the virus hopefully becomes weaker, and then gone. Great discipline is taking place in China, as President Xi strongly leads what will be a very successful operation. We are working closely with China to help!",
          "retweets": 9392,
          "person": "Trump",
          "countries": [
               "China"
          ]
     },
     {
          "date": "2020-2-7",
          "tweet": "Just had a long and very good conversation by phone with President Xi of China. He is strong, sharp and powerfully focused on leading the counterattack on the Coronavirus. He feels they are doing very well, even building hospitals in a matter of only days. Nothing is easy, but...",
          "retweets": 16717,
          "person": "Trump",
          "countries": [
               "China"
          ]
     },
     {
          "date": "2020-2-3",
          "tweet": "Republicans in Iowa, go out and Caucus today. Your great Trade Deals with China, Mexico, Canada, Japan, South Korea and more, are DONE. Great times are coming, after waiting for decades, for our Farmers, Ranchers, Manufacturers and ALL. Nobody else could have pulled this off!",
          "retweets": 20488,
          "person": "Trump",
          "countries": [
               "China",
               "Japan",
               "South Korea"
          ]
     },
     {
          "date": "2020-1-31",
          "tweet": "RT @realDonaldTrump: Working closely with China and others on Coronavirus outbreak. Only 5 people in U.S., all in good recovery.",
          "retweets": 22349,
          "person": "Trump",
          "countries": [
               "China"
          ]
     },
     {
          "date": "2020-1-30",
          "tweet": "Working closely with China and others on Coronavirus outbreak. Only 5 people in U.S., all in good recovery.",
          "retweets": 22349,
          "person": "Trump",
          "countries": [
               "China"
          ]
     },
     {
          "date": "2020-1-29",
          "tweet": "Just received a briefing on the Coronavirus in China from all of our GREAT agencies, who are also working closely with China. We will continue to monitor the ongoing developments. We have the best experts anywhere in the world, and they are on top of it 24/7! https://t.co/rrtF1Stk78",
          "retweets": 16936,
          "person": "Trump",
          "countries": [
               "China"
          ]
     },
     {
          "date": "2020-1-27",
          "tweet": "RT @SenateForeign: Today I was briefed by leading global health experts about the outbreak of a novel coronavirus in China. We learned that…",
          "retweets": 3941,
          "person": "Trump",
          "countries": [
               "China"
          ]
     },
     {
          "date": "2020-1-27",
          "tweet": "We are in very close communication with China concerning the virus. Very few cases reported in USA, but strongly on watch. We have offered China and President Xi any help that is necessary. Our experts are extraordinary!",
          "retweets": 23243,
          "person": "Trump",
          "countries": [
               "China"
          ]
     },
     {
          "date": "2020-1-24",
          "tweet": "China has been working very hard to contain the Coronavirus. The United States greatly appreciates their efforts and transparency. It will all work out well. In particular, on behalf of the American People, I want to thank President Xi!",
          "retweets": 22967,
          "person": "Trump",
          "countries": [
               "China"
          ]
     },
     {
          "date": "2020-1-24",
          "tweet": "“He’s got to explain this. How did Hunter Biden get a billion and a half dollars (from China) to invest when he’d been in business for 60 days?” @LindseyGrahamSC @FoxNews",
          "retweets": 24691,
          "person": "Trump",
          "countries": [
               "China"
          ]
     },
     {
          "date": "2020-1-23",
          "tweet": "The Democrats &amp; Shifty Schiff, whose presentation to the Senate was loaded with lies and misrepresentations, are refusing to state that the Obama Administration withheld aid from many countries including Ukraine, Pakistan, Philippines, Egypt, Honduras, &amp; Mexico. Witch Hunt!",
          "retweets": 22295,
          "person": "Trump",
          "countries": [
               "Philippines"
          ]
     },
     {
          "date": "2020-1-22",
          "tweet": "One of the many great things about our just signed giant Trade Deal with China is that it will bring both the USA &amp; China closer together in so many other ways. Terrific working with President Xi, a man who truly loves his country. Much more to come!",
          "retweets": 20461,
          "person": "Trump",
          "countries": [
               "China"
          ]
     },
     {
          "date": "2020-1-16",
          "tweet": "RT @MarshaBlackburn: This is a solid win for our farmers and manufactures – China will be purchasing $200 billion in American goods and ser…",
          "retweets": 7611,
          "person": "Trump",
          "countries": [
               "China"
          ]
     },
     {
          "date": "2020-1-16",
          "tweet": "The farmers are really happy with the new China Trade Deal and the soon to be signed deal with Mexico and Canada, but I hope the thing they will most remember is the fact that I was able to take massive incoming Tariff money and use it to help them get through the tough times!",
          "retweets": 23563,
          "person": "Trump",
          "countries": [
               "China"
          ]
     },
     {
          "date": "2020-1-16",
          "tweet": "Cryin’ Chuck Schumer is saying privately that the new China Trade Deal is  unbelievable, which it is, but publicly he knocks it whenever possible. That’s politics, but so bad for our great Country!",
          "retweets": 28345,
          "person": "Trump",
          "countries": [
               "China"
          ]
     },
     {
          "date": "2020-1-16",
          "tweet": "One of the greatest trade deals ever made! Also good for China and our long term relationship. 250 Billion Dollars will be coming back to our Country, and we are now in a great position for a Phase Two start. There has never been anything like this in U.S. history! USMCA NEXT!",
          "retweets": 34525,
          "person": "Trump",
          "countries": [
               "China"
          ]
     },
     {
          "date": "2020-1-15",
          "tweet": "RT @SenateGOP: ✓ SIGNED\n\n@realdonaldtrump just signed the Phase One Trade Agreement with China. \n\nThis is the SECOND historic trade deal Re…",
          "retweets": 10474,
          "person": "Trump",
          "countries": [
               "China"
          ]
     },
     {
          "date": "2020-1-15",
          "tweet": "RT @Scavino45: “@realDonaldTrump Signs Phase One Trade Deal with China” https://t.co/xogyW8ZVwk",
          "retweets": 10780,
          "person": "Trump",
          "countries": [
               "China"
          ]
     },
     {
          "date": "2020-1-10",
          "tweet": "RT @JerryMoran: @SenFinance Also, met with @USTradeRep Robert Lighthizer to discuss Phase One of the trade agrmt w/ China. Includes commitm…",
          "retweets": 3428,
          "person": "Trump",
          "countries": [
               "China"
          ]
     },
     {
          "date": "2020-1-7",
          "tweet": "We love Australia! https://t.co/BFPCNS81YR",
          "retweets": 25020,
          "person": "Trump",
          "countries": [
               "Australia"
          ]
     },
     {
          "date": "2020-1-1",
          "tweet": "RT @GOPChairwoman: Asian Americans are #WINNING under @realDonaldTrump.\n\nThis summer, unemployment among Asian Americans fell to 2.1% — the…",
          "retweets": 7797,
          "person": "Trump",
          "countries": [
               "Asia"
          ]
     },
     {
          "date": "2019-12-31",
          "tweet": "RT @heatherjones333: MAGNIFICENT TRUMP- KEEPING HIS PROMISES  🇺🇸 🇺🇸 🇺🇸\n\nBREAKING: President Trump Announces He Will Sign Phase One in China…",
          "retweets": 7259,
          "person": "Trump",
          "countries": [
               "China"
          ]
     },
     {
          "date": "2019-12-31",
          "tweet": "I will be signing our very large and comprehensive Phase One Trade Deal with China on January 15. The ceremony will take place at the White House. High level representatives of China will be present. At a later date I will be going to Beijing where talks will begin on Phase Two!",
          "retweets": 22730,
          "person": "Trump",
          "countries": [
               "China"
          ]
     },
     {
          "date": "2019-12-22",
          "tweet": "RT @Reuters: China will lower import tariffs on over 850 products from January 1 https://t.co/rOyxOnY9QF https://t.co/8xmiyGmiW6",
          "retweets": 8332,
          "person": "Trump",
          "countries": [
               "China"
          ]
     },
     {
          "date": "2019-12-22",
          "tweet": "RT @SkyNewsBreak: U.S. president Donald Trump says a \"breakthrough\" has been achieved in trade talks with China and he expects a deal to be…",
          "retweets": 7250,
          "person": "Trump",
          "countries": [
               "China"
          ]
     },
     {
          "date": "2019-12-22",
          "tweet": "RT @economics: BREAKING: China says it will cut import tariffs for goods including frozen pork, pharmaceuticals, paper products and some hi…",
          "retweets": 7232,
          "person": "Trump",
          "countries": [
               "China"
          ]
     },
     {
          "date": "2019-12-20",
          "tweet": "Had a very good talk with President Xi of China concerning our giant Trade Deal. China has already started large scale purchaes of agricultural product &amp; more. Formal signing being arranged. Also talked about North Korea, where we are working with China, &amp; Hong Kong (progress!).",
          "retweets": 21332,
          "person": "Trump",
          "countries": [
               "China",
               "North Korea",
               "Hong Kong"
          ]
     },
     {
          "date": "2019-12-17",
          "tweet": ".@FoxNews  “Trump wins major victories in China and USMCA trade deals, defense spending and Space Force.” Thank you!",
          "retweets": 13633,
          "person": "Trump",
          "countries": [
               "China"
          ]
     },
     {
          "date": "2019-12-16",
          "tweet": "....energy independence, manufacturing resilience, illegal immigration coming down, the Wall going up, China confronted, the caliphate defeated, NAFTA renegotiated, our military rebuilt, NATO paying more, regulations costing less,.......and much more. This is why they’re....",
          "retweets": 9991,
          "person": "Trump",
          "countries": [
               "China"
          ]
     },
     {
          "date": "2019-12-16",
          "tweet": "....energy independence, manufacturing resilience, illegal immigration coming down, the Wall going up, China confronted, the caliphate defeated, NAFTA renegotiated, our militsry rebuilt, NATO paying more, regulations costing less,.......and much more. This is why they’re....",
          "retweets": 1289,
          "person": "Trump",
          "countries": [
               "China"
          ]
     },
     {
          "date": "2019-12-14",
          "tweet": "Chuck Schumer sat for years during the Obama Administration and watched as China ripped off the United States. He &amp; the Do Nothing Democrats did NOTHING as this $ carnage took place. Now, without even seeing it, he snipes at our GREAT new deal with China. Too bad Cryin’ Chuck!",
          "retweets": 32723,
          "person": "Trump",
          "countries": [
               "China"
          ]
     },
     {
          "date": "2019-12-13",
          "tweet": "We have agreed to a very large Phase One Deal with China. They have agreed to many structural changes and massive purchases of Agricultural Product, Energy, and Manufactured Goods, plus much more. The 25% Tariffs will remain as is, with 7 1/2% put on much of the remainder....",
          "retweets": 25680,
          "person": "Trump",
          "countries": [
               "China"
          ]
     },
     {
          "date": "2019-12-13",
          "tweet": "The Wall Street Journal story on the China Deal is completely wrong, especially their statement on Tariffs. Fake News. They should find a better leaker!",
          "retweets": 27081,
          "person": "Trump",
          "countries": [
               "China"
          ]
     },
     {
          "date": "2019-12-12",
          "tweet": "Getting VERY close to a BIG DEAL with China. They want it, and so do we!",
          "retweets": 28464,
          "person": "Trump",
          "countries": [
               "China"
          ]
     },
     {
          "date": "2019-12-10",
          "tweet": "Just had a very good meeting with Foreign Minister Sergey Lavrov and representatives of Russia. Discussed many items including Trade, Iran, North Korea, INF Treaty, Nuclear Arms Control, and Election Meddling. Look forward to continuing our dialogue in the near future! https://t.co/tHecH9a9ck",
          "retweets": 10871,
          "person": "Trump",
          "countries": [
               "North Korea"
          ]
     },
     {
          "date": "2019-12-8",
          "tweet": "RT @WarRoom2020: Navarro: Why at the Dem debates do they never talk about China or the economy? Because they don’t want to admit President…",
          "retweets": 5413,
          "person": "Trump",
          "countries": [
               "China"
          ]
     },
     {
          "date": "2019-12-8",
          "tweet": "....Biden on the board of the largest natural gas company in Ukraine, getting paid $83,000 a month, 10 times as much as a board member of @exxonmobil.” Thank you Ted. He also  made a fortune from China and others, but zero before his father became V.P. @MeetThePress",
          "retweets": 12007,
          "person": "Trump",
          "countries": [
               "China"
          ]
     },
     {
          "date": "2019-12-8",
          "tweet": "....with the U.S. Presidential Election in November. North Korea, under the leadership of Kim Jong Un, has tremendous economic potential, but it must denuclearize as promised. NATO, China, Russia, Japan, and the entire world is unified on this issue!",
          "retweets": 8691,
          "person": "Trump",
          "countries": [
               "China",
               "Japan",
               "North Korea"
          ]
     },
     {
          "date": "2019-12-8",
          "tweet": "Kim Jong Un is too smart and has far too much to lose, everything actually, if he acts in a hostile way. He signed a strong Denuclearization Agreement with me in Singapore. He does not want to void his special relationship with the President of the United States or interfere.... https://t.co/THfOjfB2uE",
          "retweets": 11748,
          "person": "Trump",
          "countries": [
               "Singapore"
          ]
     },
     {
          "date": "2019-12-6",
          "tweet": "Why is the World Bank loaning money to China? Can this be possible? China has plenty of money, and if they don’t, they create it. STOP!",
          "retweets": 35283,
          "person": "Trump",
          "countries": [
               "China"
          ]
     },
     {
          "date": "2019-12-2",
          "tweet": "U.S. Markets are up as much as 21% since the announcement of Tariffs on 3/1/2018 - and the U.S. is taking in massive amounts of money (and giving some to our farmers, who have been targeted by China)!",
          "retweets": 14126,
          "person": "Trump",
          "countries": [
               "China"
          ]
     },
     {
          "date": "2019-11-18",
          "tweet": "Just finished a very good &amp; cordial meeting at the White House with Jay Powell of the Federal Reserve. Everything was discussed including interest rates, negative interest, low inflation, easing, Dollar strength &amp; its effect on manufacturing, trade with China, E.U. &amp; others, etc.",
          "retweets": 17509,
          "person": "Trump",
          "countries": [
               "China"
          ]
     },
     {
          "date": "2019-11-18",
          "tweet": "Just finished a very good &amp; cordial meeting at the White House with Jay Powell of the Federal Reserve. Everything was discused including interest rates, negative interest, low inflation, easing, Dollar strength &amp; its effect on manufacturing, trade with China, E.U. &amp; others, etc.",
          "retweets": 2523,
          "person": "Trump",
          "countries": [
               "China"
          ]
     },
     {
          "date": "2019-11-17",
          "tweet": "Our great Farmers will recieve another major round of “cash,” compliments of China Tariffs, prior to Thanksgiving. The smaller farms and farmers will be big beneficiaries. In the meantime, and as you may have noticed, China is starting to buy big again. Japan deal DONE. Enjoy!",
          "retweets": 24960,
          "person": "Trump",
          "countries": [
               "China",
               "Japan"
          ]
     },
     {
          "date": "2019-11-12",
          "tweet": "....Ukrainian energy company, and more millions taken from China, and now reports of other companies and countries also giving him big money, are certainly looking very corrupt (to put it mildly!) to me. Both Bidens should be forced to testify in this No Due Process Scam!",
          "retweets": 12551,
          "person": "Trump",
          "countries": [
               "China"
          ]
     }
]
