[
     {
          "date": "2019-11-18",
          "tweet": "China’s internment of nearly one million Uighur Muslims is among the worst abuses of human rights in the world today. The U.S. cannot be silent — we must speak out against this oppression and relentlessly defend human rights around the world. https://t.co/PQp04TWjyd",
          "retweets": 878,
          "person": "Biden",
          "countries": [
               "China"
          ]
     },
     {
          "date": "2019-11-21",
          "tweet": "Under President Trump, the North Korean nuclear threat is getting worse, not better. As President, Joe Biden will coordinate closely with our allies and hold China accountable for not putting pressure on North Korea. He'll see Kim Jong Un for what he is — a ruthless tyrant.",
          "retweets": 389,
          "person": "Biden",
          "countries": [
               "China",
               "North Korea"
          ]
     },
     {
          "date": "2019-11-21",
          "tweet": "Human rights should be at the core of our engagement with the world--not the periphery. As president, Joe Biden will hold accountable Saudi Arabia, China, and every nation that violates the human rights of their citizens. #DemDebate",
          "retweets": 304,
          "person": "Biden",
          "countries": [
               "China"
          ]
     },
     {
          "date": "2019-12-10",
          "tweet": "Yesterday, on the eve of #HumanRightsDay, Trump again coddled a dictator—blocking a UN meeting on North Korean human rights, betraying our values. Trump continues to side with the brutal Kim Jong Un regime at the expense of American leadership, our allies, and our security. https://t.co/ZuuqQ5hJG0",
          "retweets": 464,
          "person": "Biden",
          "countries": [
               "North Korea"
          ]
     },
     {
          "date": "2019-12-20",
          "tweet": "The United States and our partners make up more than half of global GDP. If we stand together, China won’t be able to withstand the pressure. We should be mobilizing our allies to meet this challenge, not driving them away. #DemDebate",
          "retweets": 285,
          "person": "Biden",
          "countries": [
               "China"
          ]
     },
     {
          "date": "2019-12-20",
          "tweet": "China commits enormous human rights abuses, and denies its citizens access to basic information — all while Trump looks the other way. If I am president, human rights won't be blacked out of the conversation. https://t.co/1019FCsLYt",
          "retweets": 1197,
          "person": "Biden",
          "countries": [
               "China"
          ]
     },
     {
          "date": "2020-01-11",
          "tweet": "Firefighters represent the best of America — courageous, selfless, and always answering the call to duty. I'm grateful to those who are heading to help our friends in Australia battle devastating wildfires. https://t.co/ncemFZLB6M",
          "retweets": 1735,
          "person": "Biden",
          "countries": [
               "Australia"
          ]
     },
     {
          "date": "2020-01-11",
          "tweet": "Congratulations to President Tsai and the people of Taiwan for another successful election. You are stronger because of your free and open society. The United States should continue strengthening our ties with Taiwan and other like-minded democracies. https://t.co/NAt6ldYpRj",
          "retweets": 1651,
          "person": "Biden",
          "countries": [
               "Taiwan"
          ]
     },
     {
          "date": "2020-01-15",
          "tweet": "I wouldn’t meet with Kim Jong Un without pre-conditions. By meeting with him, Donald Trump gave Kim Jong Un what he was looking for: legitimacy. I will work closely with our allies and hold China accountable for its lack of pressure on the Kim regime’s bad behavior. #DemDebate",
          "retweets": 420,
          "person": "Biden",
          "countries": [
               "China"
          ]
     },
     {
          "date": "2020-01-15",
          "tweet": "If we don’t write the global rules of the road for trade, cyber, climate change, and so much more, they may be written by China or other nations that don’t share our values. #DemDebate",
          "retweets": 255,
          "person": "Biden",
          "countries": [
               "China"
          ]
     },
     {
          "date": "2020-01-19",
          "tweet": "The 60th anniversary of our alliance with Japan reminds us that close partnership and deep cooperation are among our greatest assets. I understand the value of our alliances; they make us stronger. I would build on this legacy, rather than dismantling it.",
          "retweets": 790,
          "person": "Biden",
          "countries": [
               "Japan"
          ]
     },
     {
          "date": "2020-01-26",
          "tweet": "The seas are rising. Australia is burning. And in this moment of crisis, our President thinks windmills cause cancer. Solving the climate crisis, starts with beating Donald Trump. And once I do, we'll pass my ambitious climate plan. https://t.co/uClGwalbRW",
          "retweets": 988,
          "person": "Biden",
          "countries": [
               "Australia"
          ]
     },
     {
          "date": "2020-02-26",
          "tweet": "We gotta make it clear: China must play by the rules. #DemDebate",
          "retweets": 414,
          "person": "Biden",
          "countries": [
               "China"
          ]
     },
     {
          "date": "2020-02-27",
          "tweet": "If I were president today, I would not be taking China's word when it comes to the coronavirus. American scientists and health experts should be allowed in the country to determine how the virus started and to help contain its spread. https://t.co/uSgkV7WUG8",
          "retweets": 2817,
          "person": "Biden",
          "countries": [
               "China"
          ]
     },
     {
          "date": "2020-03-21",
          "tweet": "In times of crisis, the American people deserve a president who tells them the truth and takes responsibility. Donald Trump has not been that president. For months, he falsely told us we had nothing to worry about while praising China’s response for managing the coronavirus.",
          "retweets": 12419,
          "person": "Biden",
          "countries": [
               "China"
          ]
     },
     {
          "date": "2020-04-10",
          "tweet": "We need a president who demonstrates the leadership to address every aspect of this pandemic  —  including the spate of racist incidents targeting Asian Americans and Pacific Islanders  —  with urgency and seriousness. Donald Trump is not that president. https://t.co/4dvq4uiv17",
          "retweets": 5354,
          "person": "Biden",
          "countries": [
               "Asia"
          ]
     },
     {
          "date": "2020-04-17",
          "tweet": "The uncomfortable truth is that Donald Trump left America exposed and vulnerable to this pandemic. He ignored the warnings of health experts and intelligence agencies and put his trust in China's leaders instead. Now, we're all paying the price.\n\nLet me explain how we got here: https://t.co/esvCaGki9V",
          "retweets": 19337,
          "person": "Biden",
          "countries": [
               "China"
          ]
     },
     {
          "date": "2020-04-17",
          "tweet": "President Trump is trying to rewrite history when it comes to China and COVID-19 — but the facts don't back him up. Tony Blinken was the Deputy Secretary of State and is one of my top foreign policy advisors. He'll explain. https://t.co/si3vDHnF2r",
          "retweets": 25778,
          "person": "Biden",
          "countries": [
               "China"
          ]
     },
     {
          "date": "2020-04-19",
          "tweet": "The United States should be standing up for freedom and standing with the people of Hong Kong. Instead, Trump has said he's “standing with Xi Jinping.” That's weak. We need to be strong on values when it comes to China. That's what I'll do as president. https://t.co/O2o66tJFkY",
          "retweets": 9909,
          "person": "Biden",
          "countries": [
               "China",
               "Hong Kong"
          ]
     },
     {
          "date": "2020-05-01",
          "tweet": "As we mark the beginning of Asian Pacific American Heritage Month, @DrBiden and I extend our best wishes to AANHPI communities across America. We look forward to celebrating your extraordinary accomplishments and contributions in the month ahead.",
          "retweets": 1739,
          "person": "Biden",
          "countries": [
               "Asia"
          ]
     },
     {
          "date": "2020-05-02",
          "tweet": "We left a playbook. He ignored it.\n\nWe created an office to prepare for pandemics. He gutted it.\n\nWe had CDC officials in China to detect and contain outbreaks. He pulled them out.\n\nTrump can try and shift blame all he wants, but the fact is his actions left us unprepared. https://t.co/NdsINZ307m",
          "retweets": 57114,
          "person": "Biden",
          "countries": [
               "China"
          ]
     },
     {
          "date": "2020-05-20",
          "tweet": "Congratulations to Dr. @iingwen on the start of her second term. Taiwan’s thriving democracy and response to COVID-19 are an example to the world. America’s support for Taiwan must remain strong, principled, and bipartisan. https://t.co/82aw9TFh8z",
          "retweets": 2194,
          "person": "Biden",
          "countries": [
               "Taiwan"
          ]
     },
     {
          "date": "2020-05-27",
          "tweet": "Over the last few months, countless Asian Americans have been threatened, attacked, and blamed for COVID-19. They've cruelly been made the scapegoat by the most powerful man on the planet, President Trump. It has to end.\n\nRead more from @TammyforIL and me: https://t.co/W7h54A91U9",
          "retweets": 4063,
          "person": "Biden",
          "countries": [
               "Asia"
          ]
     },
     {
          "date": "2020-06-12",
          "tweet": "Two years after Trump's Singapore meeting with North Korean dictator Kim Jong Un, the U.S. and our allies are less safe and Kim's arsenal of nuclear weapons and ballistic missiles keeps growing. Photo-ops and love letters are no substitute for deterrence and principled diplomacy. https://t.co/YfaCdlwJ8S",
          "retweets": 6612,
          "person": "Biden",
          "countries": [
               "North Korea",
               "Singapore"
          ]
     },
     {
          "date": "2020-06-22",
          "tweet": "Trump opposed sanctioning China’s government over its atrocious human rights violations to protect his hollow trade deal and serve his own personal interests.\n\nWhere Trump has been weak, I will be strong, clear, and consistent in standing up for America's values and its people. https://t.co/AgGPD46JJN",
          "retweets": 8289,
          "person": "Biden",
          "countries": [
               "China"
          ]
     },
     {
          "date": "2020-08-11",
          "tweet": "This is the latest dire consequence of Donald Trump looking the other way on Beijing's repression in Hong Kong. Instead of standing for freedom and democracy, he consistently stands with Xi Jinping.\n\nI'll put American values back at the center of our foreign policy. https://t.co/3RAZOeVtHr",
          "retweets": 7162,
          "person": "Biden",
          "countries": [
               "Hong Kong"
          ]
     },
     {
          "date": "2020-08-12",
          "tweet": ".@KamalaHarris is the daughter of proud immigrants—a mother from India and a father from Jamaica—who raised her to take action.\nThat’s exactly what this moment calls for: action. And we hope you’ll take action with us: https://t.co/K3mVwfTxXJ https://t.co/MZLAx9IN6C",
          "retweets": 17134,
          "person": "Biden",
          "countries": [
               "India"
          ]
     },
     {
          "date": "2020-08-12",
          "tweet": "As the daughter of Jamaican and Indian immigrants, @KamalaHarris grew up believing in the promise of America because she saw it firsthand.\n\nTogether, Kamala and I are going to fight every single day in the White House to make sure that promise is fulfilled for all Americans.",
          "retweets": 14236,
          "person": "Biden",
          "countries": [
               "India"
          ]
     },
     {
          "date": "2020-08-22",
          "tweet": "To everyone celebrating the Hindu festival of Ganesh Chaturthi in the U.S., India, and around the world, may you overcome all obstacles, be blessed with wisdom, and find a path toward new beginnings.",
          "retweets": 19324,
          "person": "Biden",
          "countries": [
               "India"
          ]
     },
     {
          "date": "2020-09-01",
          "tweet": "President Shri Pranab Mukherjee was a devout public servant who believed deeply in the importance of our two nations tackling global challenges together. Jill and I are saddened to hear of his passing — our prayers go out to his loved ones and the Indian people. https://t.co/SJfaDEKjGi",
          "retweets": 2676,
          "person": "Biden",
          "countries": [
               "India"
          ]
     },
     {
          "date": "2020-09-08",
          "tweet": "Mr. President — If you’re so good at making deals, then why does your trade deal cost American workers so much pain while letting China off the hook for its biggest trade abuses? https://t.co/mL8a67CTAw",
          "retweets": 16908,
          "person": "Biden",
          "countries": [
               "China"
          ]
     },
     {
          "date": "2020-09-30",
          "tweet": "Donald Trump talks a lot about the art of the deal. But under his watch, China has perfected the art of the steal. https://t.co/OSTsHHTtBQ",
          "retweets": 3147,
          "person": "Biden",
          "countries": [
               "China"
          ]
     },
     {
          "date": "2020-10-24",
          "tweet": "President Trump called India \"filthy.\"\n\nIt's not how you talk about friends—and it's not how you solve global challenges like climate change.\n\n@KamalaHarris and I deeply value our partnership—and will put respect back at the center of our foreign policy. https://t.co/TKcyZiNwY6",
          "retweets": 7681,
          "person": "Biden",
          "countries": [
               "India"
          ]
     }
]
